<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
TIBCO EBX® Documentation - Interface utilisateur</title>
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type"></meta><meta content="Copyright TIBCO Software Inc. 2001-2021. All rights reserved." name="copyright"></meta><meta content="gui" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="stylesheet" type="text/css" href="../resources/syntaxHighlighter/styles/shCoreEclipse.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
TIBCO EBX®</div>
<div class="chapterName">
Documentation &gt; Guide utilisateur &gt; Introduction</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" class="ebx_clickableIconLink" href="../index.html?page=user_introduction/gui.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation" target="_top">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Introduction</span></div>
<h1>
Interface utilisateur</h1>
<div id="toc">
<ul class="toc1">
<li class="toc1"><a href="#id1">Pr&eacute;sentation</a></li><li class="toc1"><a href="#advanced_perspective">Perspective avanc&eacute;e</a></li><li class="toc1"><a href="#perspective">Perspectives</a><ul class="toc2">
<li class="toc2"><a href="#favoritePerspectives">Perspectives favorites</a></li></ul>
</li><li class="toc1"><a href="#userPane">Panneau utilisateur</a><ul class="toc2">
<li class="toc2"><a href="#avatar">Avatar</a></li><li class="toc2"><a href="#density">Densit&eacute;</a></li></ul>
</li><li class="toc1"><a href="#id5">Fonctionnalit&eacute;s de l&#39;interface utilisateur</a><ul class="toc2">
<li class="toc2"><a href="#id5s1">R&eacute;initialiser la largeur du panneau de navigation</a></li></ul>
</li><li class="toc1"><a href="#id6">O&ugrave; trouver de l&#39;aide sur EBX&reg;</a><ul class="toc2">
<li class="toc2"><a href="#id6s1">Aide contextuelle</a></li><li class="toc2"><a href="#id6s2">Aide contextuelle sur &eacute;l&eacute;ments</a></li></ul>
</li></ul>
</div>
<h2 id="id1">
Pr&eacute;sentation</h2>
<p>La pr&eacute;sentation g&eacute;n&eacute;rale des espaces de travail sur TIBCO EBX&reg; peut &ecirc;tre enti&egrave;rement personnalis&eacute;e par un administrateur. </p><p>Lorsque plusieurs perspectives personnalis&eacute;es ont &eacute;t&eacute; cr&eacute;&eacute;es, elles peuvent &ecirc;tre s&eacute;lectionn&eacute;es via l&#39;ic&ocirc;ne &#39;Perspective&#39; dans l&#39;en-t&ecirc;te de l&#39;&eacute;cran.</p><p>La perspective avanc&eacute;e est accessible par d&eacute;faut. </p><h2 id="advanced_perspective">
Perspective avanc&eacute;e</h2>
<p>Par d&eacute;faut, la perspective avanc&eacute;e d&#39;EBX&reg; est accessible &agrave; tous les utilisateurs. Cependant, son acc&egrave;s peut &ecirc;tre restreint &agrave; certains profils uniquement. Cette vue est divis&eacute;e en plusieurs zones principales, r&eacute;f&eacute;renc&eacute;es dans la documentation sous les termes suivants:</p><ul>
<li><p><strong>En-t&ecirc;te</strong>&nbsp;:&nbsp;l&#39;avatar de l&#39;utilisateur actuel s&#39;affiche dans cette zone, ainsi que l&#39;ic&ocirc;ne de s&eacute;lection des perspectives. En cliquant sur l&#39;avatar de l&#39;utilisateur, le panneau utilisateur s&#39;ouvre.</p></li><li><p><strong>Barre de menu</strong>&nbsp;:&nbsp;cette zone comprend toutes les fonctionnalit&eacute;s accessibles &agrave; l&#39;utilisateur actuel et lui permet de naviguer entre elles.</p></li><li><p><strong>Panneau de navigation</strong>&nbsp;:&nbsp;cette zone r&eacute;sume visuellement les diverses possibilit&eacute;s de navigation. Par exemple : s&eacute;lectionner une table dans un jeu de donn&eacute;es, ou un bon de travail dans un workflow.</p></li><li><p><strong>Espace de travail</strong>&nbsp;:&nbsp;zone de travail principale d&eacute;pendant du contexte. Par exemple, la table s&eacute;lectionn&eacute;e dans le panneau de navigation s&#39;affiche dans l&#39;espace de travail, ou bien un bon de travail en cours s&#39;y ex&eacute;cute.</p></li></ul>
<p>Les sections fonctionnelles suivantes sont affich&eacute;es dans l&#39;interface selon les permissions de l&#39;utilisateur actuel : <em>Donn&eacute;es</em>, <em>Espace de donn&eacute;es</em>, <em>Mod&eacute;lisation</em>, <em>Workflow de donn&eacute;es</em>, <em>Services de donn&eacute;es</em>, et <em>Administration</em>.</p><p align="left"><img alt="/UserInterface.png" src="../resources/images/user_introduction/UserInterface.png"></img></p><h2 id="perspective">
Perspectives</h2>
<p>Les perspectives dans EBX&reg; sont des vues configurables avec une audience d&eacute;finie. Les perspectives permettent aux utilisateurs m&eacute;tier de b&eacute;n&eacute;ficier d&#39;une interface simplifi&eacute;e. Une perspective peut &ecirc;tre affect&eacute;e &agrave; un ou plusieurs profils. Cette vue est divis&eacute;e en plusieurs zones principales, r&eacute;f&eacute;renc&eacute;es dans la documentation sous les termes suivants :</p><ul>
<li><p><strong>En-t&ecirc;te </strong>: l&#39;avatar de l&#39;utilisateur actuel s&#39;affiche dans cette zone, ainsi que l&#39;ic&ocirc;ne de s&eacute;lection des perspectives (lorsque plusieurs sont disponibles). En cliquant sur l&#39;avatar de l&#39;utilisateur, le panneau utilisateur s&#39;ouvre.</p></li><li><p><strong>Panneau de navigation </strong>: cette zone affiche le menu hi&eacute;rarchique tel qu&#39;il a &eacute;t&eacute; configur&eacute; par l&#39;administrateur de perspectives. Ce panneau peut &ecirc;tre d&eacute;velopp&eacute; ou r&eacute;duit et permet d&#39;acc&eacute;der aux entit&eacute;s et services correspondant &agrave; l&#39;activit&eacute; de l&#39;utilisateur.</p></li><li><p><strong>Espace de travail </strong>: zone de travail principale d&eacute;pendant du contexte.</p></li></ul>
<p>Exemple de menu hi&eacute;rarchique :</p><p align="left"><img alt="/perspectives.png" src="../resources/images/user_introduction/perspectives.png"></img></p><h3 id="favoritePerspectives">
Perspectives favorites</h3>
<p>Un utilisateur, lorsque plusieurs perspectives ont &eacute;t&eacute; d&eacute;finies pour son profil, peut d&eacute;finir une perspective favorite afin que cette derni&egrave;re soit s&eacute;lectionn&eacute;e par d&eacute;faut &agrave; sa connexion. Pour ce faire, une ic&ocirc;ne est pr&eacute;sente &agrave; c&ocirc;t&eacute; de chaque perspective dans le s&eacute;lecteur de perspectives&nbsp;:&nbsp;</p><ul>
<li><p>Une &eacute;toile pleine indique la perspective favorite. Un clic sur cette ic&ocirc;ne d&eacute;s&eacute;lectionne la perspective favorite.</p></li><li><p>Une &eacute;toile vide indique que la perspective associ&eacute;e n&#39;est pas la favorite. Un clic sur cette ic&ocirc;ne va d&eacute;finir cette perspective comme favorite.</p></li></ul>
<p align="left"><img alt="/favoritePerspectives.png" src="../resources/images/user_introduction/favoritePerspectives.png"></img></p><h2 id="userPane">
Panneau utilisateur</h2>
<p>Les fonctionnalit&eacute;s g&eacute;n&eacute;rales d&#39;EBX&reg; sont regroup&eacute;es dans le panneau utilisateur. Pour y acc&eacute;der, cliquer sur l&#39;avatar (ou les initiales) de l&#39;utilisateur actuel, dans l&#39;en-t&ecirc;te de chaque page.</p><p>Le panneau utilisateur affiche alors l&#39;avatar de l&#39;utilisateur et donne acc&egrave;s &agrave; la configuration du profil (selon les droits de l&#39;utilisateur), &agrave; la s&eacute;lection de la langue et de la densit&eacute; d&#39;affichage&nbsp;;&nbsp;et &agrave; la documentation en ligne.</p><div class="ebx_attention">
<h5>
Attention</h5>
<p>Le bouton de d&eacute;connexion est situ&eacute; sur le panneau utilisateur.</p></div>
<h3 id="avatar">
Avatar</h3>
<p>Un avatar peut &ecirc;tre d&eacute;fini pour chaque utilisateur. L&#39;avatar est constitu&eacute; d&#39;une image, d&eacute;finie via une URL&nbsp;;&nbsp;ou de deux lettres (par d&eacute;faut les initiales de l&#39;utilisateur). La couleur de fond est attribu&eacute;e automatiquement et ne peut pas &ecirc;tre modifi&eacute;e. L&#39;image utilis&eacute;e doit imp&eacute;rativement &ecirc;tre au format carr&eacute; mais n&#39;est pas limit&eacute;e en termes de taille.</p><p>L&#39;affichage de l&#39;avatar peut &ecirc;tre personnalis&eacute; &agrave; partir de la section &#39;Ergonomie et disposition&#39; dans &#39;Administration&#39;. Il est possible d&#39;afficher l&#39;avatar, le nom de l&#39;utilisateur, ou les deux &agrave; la fois.</p><h3 id="density">
Densit&eacute;</h3>
<p>La densit&eacute; d&#39;affichage de la police peut &ecirc;tre personnalis&eacute;e : &#39;Compacte&#39; ou &#39;Confortable&#39;. Le mode d&#39;affichage peut &ecirc;tre modifi&eacute; via le panneau utilisateur.</p><h2 id="id5">
Fonctionnalit&eacute;s de l&#39;interface utilisateur</h2>
<h3 id="id5s1">
R&eacute;initialiser la largeur du panneau de navigation</h3>
<p>Si la largeur du panneau de navigation a &eacute;t&eacute; modifi&eacute;e, elle peut &ecirc;tre r&eacute;initialis&eacute;e en double-cliquant sur la bordure.</p><p><img alt="/navpanel_resize.png" src="../resources/images/user_introduction/navpanel_resize.png"></img></p><h2 id="id6">
O&ugrave; trouver de l&#39;aide sur EBX&reg;</h2>
<p>En plus de la documentation compl&egrave;te du produit accessible via le <a href="#userPane">panneau utilisateur</a>, l&#39;aide est accessible de plusieurs fa&ccedil;ons dans l&#39;interface.</p><h3 id="id6s1">
Aide contextuelle</h3>
<p>Dans n&#39;importe quel espace de travail d&#39;EBX&reg;, une aide sp&eacute;cifique au contexte actuel est disponible en cliquant sur le point d&#39;interrogation situ&eacute; &agrave; droite du second bandeau. Le chapitre correspondant de la documentation produit sera alors affich&eacute;.</p><h3 id="id6s2">
Aide contextuelle sur &eacute;l&eacute;ments</h3>
<p>Lorsque la souris survole un &eacute;l&eacute;ment pour lequel une aide sp&eacute;cifique a &eacute;t&eacute; d&eacute;finie, un point d&#39;interrogation apparaît. En cliquant sur le point d&#39;interrogation, un panneau de documentation affiche les informations associ&eacute;es.</p><p><img alt="Panneau avec informations sur l'élément" src="../resources/images/user_introduction/documentation_pane.png"></img></p><p>Un bouton dans le coin sup&eacute;rieur droit du panneau permet de r&eacute;cup&eacute;rer un permalien vers l&#39;&eacute;l&eacute;ment. Ce bouton n&#39;est pas disponible pour tous les types d&#39;&eacute;l&eacute;ments.</p><p><img alt="Panneau avec permalien" src="../resources/images/user_introduction/documentation_pane2.png"></img></p><p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a href="../table_contents_user.html">Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Introduction</span></div>
</div>
<p id="ebx_footer"><b>TIBCO EBX® Version 6.0.1. </b>Copyright &copy; <a href="https://www.tibco.com" target="_blank" style="text-decoration: none;">TIBCO&nbsp;Software&nbsp;Inc.</a> 2001-2021. All rights reserved.<br></br>All third party product and company names and third party marks mentioned in this document are the property of their respective owners and are mentioned for identification.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shCore.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushBash.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushCss.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushDiff.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJava.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJScript.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushPlain.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushProperties.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushSql.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushXml.js">
</script>
<script type="text/javaScript">
SyntaxHighlighter.all();</script>
</body>
</html>
