<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
TIBCO EBX® Documentation - Mod&eacute;lisation de la structure des donn&eacute;es</title>
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type"></meta><meta content="Copyright TIBCO Software Inc. 2001-2021. All rights reserved." name="copyright"></meta><meta content="dm_structure" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="stylesheet" type="text/css" href="../resources/syntaxHighlighter/styles/shCoreEclipse.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
TIBCO EBX®</div>
<div class="chapterName">
Documentation &gt; Guide utilisateur &gt; Modèles de données &gt; Implémentation des modèles de données</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" class="ebx_clickableIconLink" href="../index.html?page=user_datamodel/userdatamodel_implementdatastructure.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation" target="_top">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Modèles de données &gt; Implémentation des modèles de données</span></div>
<h1>
Mod&eacute;lisation de la structure des donn&eacute;es</h1>
<p>Pour d&eacute;finir la structure du mod&egrave;le de donn&eacute;es, s&eacute;lectionnez le mod&egrave;le de donn&eacute;es avec lequel vous voulez travailler dans le panneau de navigation.</p><p>La structure du mod&egrave;le de donn&eacute;es est accessible depuis le panneau de navigation dans la section &quot;Structure de donn&eacute;es&quot;. Cette section permet de visualiser et de d&eacute;finir la structure des champs, groupes, et tables du mod&egrave;le de donn&eacute;es.</p><div id="toc">
<ul class="toc1">
<li class="toc1"><a href="#id1">Actions et propri&eacute;t&eacute;s communes</a><ul class="toc2">
<li class="toc2"><a href="#id1s1">Cr&eacute;er des &eacute;l&eacute;ments</a></li><li class="toc2"><a href="#delete">Supprimer des &eacute;l&eacute;ments</a></li><li class="toc2"><a href="#duplicate">Dupliquer des &eacute;l&eacute;ments existants</a></li><li class="toc2"><a href="#move">D&eacute;placer des &eacute;l&eacute;ments</a></li></ul>
</li><li class="toc1"><a href="#reusableTypes">Types r&eacute;utilisables</a><ul class="toc2">
<li class="toc2"><a href="#reusableDefine">D&eacute;finition d&#39;un type r&eacute;utilisable</a></li><li class="toc2"><a href="#reusableUse">Utilisation d&#39;un type r&eacute;utilisable</a></li><li class="toc2"><a href="#includeDataModel">Inclusion des types de donn&eacute;es d&eacute;finis dans d&#39;autres mod&egrave;les de donn&eacute;es</a></li></ul>
</li><li class="toc1"><a href="#id3">D&eacute;tails de la cr&eacute;ation des &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#addfield">Cr&eacute;ation de champs</a></li><li class="toc2"><a href="#addtable">Cr&eacute;ation de tables</a></li><li class="toc2"><a href="#addgroup">Cr&eacute;ation de groupes</a></li><li class="toc2"><a href="#addpkey">Cr&eacute;ation de cl&eacute;s primaires</a></li><li class="toc2"><a href="#addfkey">Cr&eacute;ation ou d&eacute;finition de cl&eacute;s &eacute;trang&egrave;res</a></li><li class="toc2"><a href="#addAssociation">Cr&eacute;ation d&#39;associations</a></li></ul>
</li><li class="toc1"><a href="#id4">Modification des &eacute;l&eacute;ments existants</a><ul class="toc2">
<li class="toc2"><a href="#removepkey">Suppression d&#39;un champ de la cl&eacute; primaire</a></li></ul>
</li></ul>
</div>
<h2 id="id1">
Actions et propri&eacute;t&eacute;s communes</h2>
<h3 id="id1s1">
Cr&eacute;er des &eacute;l&eacute;ments</h3>
<p>Les &eacute;l&eacute;ments suivants peuvent &ecirc;tre ajout&eacute;s &agrave; un mod&egrave;le de donn&eacute;es :</p><ul>
<li><p>champs</p></li><li><p>groupes</p></li><li><p>tables</p></li><li><p>cl&eacute;s primaires</p></li><li><p>cl&eacute;s &eacute;trang&egrave;res</p></li><li><p>associations</p></li></ul>
<p>Ajoutez un de ces &eacute;l&eacute;ments sous un &eacute;l&eacute;ment existant en cliquant sur la fl&egrave;che <img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img> situ&eacute;e &agrave; la droite de l&#39;&eacute;l&eacute;ment existant, puis en s&eacute;lectionnant une option de cr&eacute;ation parmi les options pr&eacute;sent&eacute;es dans le menu. Suivez ensuite l&#39;assistant de cr&eacute;ation pour cr&eacute;er un &eacute;l&eacute;ment.</p><div class="ebx_note">
<h5>
Note</h5>
<p>L&#39;&eacute;l&eacute;ment <code>root</code> est ajout&eacute; par d&eacute;faut lors de la cr&eacute;ation d&#39;un mod&egrave;le de donn&eacute;es. Cet &eacute;l&eacute;ment repr&eacute;sente la racine de la structure du mod&egrave;le de donn&eacute;es. S&#39;il faut renommer cet &eacute;l&eacute;ment, il peut &ecirc;tre supprim&eacute; et recr&eacute;&eacute; avec un nom diff&eacute;rent.</p></div>
<h4>
Noms, libell&eacute;s, descriptions, et informations</h4>
<p>Le nom de l&#39;&eacute;l&eacute;ment &agrave; cr&eacute;er est obligatoire. Ce nom doit &ecirc;tre unique au sein d&#39;un m&ecirc;me niveau dans la structure de donn&eacute;es. En effet, sous un m&ecirc;me groupe, deux &eacute;l&eacute;ments ne peuvent avoir le m&ecirc;me nom. Une fois l&#39;&eacute;l&eacute;ment cr&eacute;&eacute;, son nom ne peut plus &ecirc;tre modifi&eacute;.</p><p>Il est possible de d&eacute;finir des libell&eacute;s localis&eacute;s qui seront affich&eacute;s dans l&#39;interface utilisateur au lieu du nom unique de l&#39;&eacute;l&eacute;ment. Il est aussi possible de d&eacute;finir une description localis&eacute;e de l&#39;&eacute;l&eacute;ment. Contrairement au nom de l&#39;&eacute;l&eacute;ment, les libell&eacute;s et descriptions sont modifiables apr&egrave;s la cr&eacute;ation de l&#39;&eacute;l&eacute;ment. Selon la pr&eacute;f&eacute;rence de langue de chaque utilisateur, TIBCO EBX&reg; affichera le libell&eacute; et la description localis&eacute;s de l&#39;&eacute;l&eacute;ment.</p><h3 id="delete">
Supprimer des &eacute;l&eacute;ments</h3>
<p>Tous les &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es peuvent &ecirc;tre supprim&eacute;s de la structure de donn&eacute;es en utilisant la fl&egrave;che <img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img> situ&eacute;e &agrave; la droite de l&#39;&eacute;l&eacute;ment &agrave; supprimer.</p><p>Si un groupe ou une table n&#39;utilisant pas un type r&eacute;utilisable est supprim&eacute;, la suppression est effectu&eacute;e r&eacute;cursivement sur tous les &eacute;l&eacute;ments situ&eacute;s sous le groupe ou la table.</p><h3 id="duplicate">
Dupliquer des &eacute;l&eacute;ments existants</h3>
<p>Pour dupliquer un &eacute;l&eacute;ment, cliquez sur la fl&egrave;che <img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img> situ&eacute;e &agrave; la droite de l&#39;&eacute;l&eacute;ment &agrave; dupliquer. Sp&eacute;cifiez le nom de l&#39;&eacute;l&eacute;ment dupliqu&eacute;. Ce nom doit &ecirc;tre unique au sein d&#39;un m&ecirc;me niveau dans la structure de donn&eacute;es. Toutes les propri&eacute;t&eacute;s de l&#39;&eacute;l&eacute;ment source sont dupliqu&eacute;es.</p><p>L&#39;&eacute;l&eacute;ment dupliqu&eacute; est rajout&eacute; dans le mod&egrave;le de donn&eacute;es au m&ecirc;me niveau que l&#39;&eacute;l&eacute;ment d&#39;origine, en derni&egrave;re position. Lorsqu&#39;un &eacute;l&eacute;ment contenant d&#39;autres &eacute;l&eacute;ments est dupliqu&eacute;, tous les sous-&eacute;l&eacute;ments sont dupliqu&eacute;s avec leurs noms originaux.</p><div class="ebx_note">
<h5>
Note</h5>
<p>En cas de duplication d&#39;un champ appartenant &agrave; une cl&eacute; primaire, les propri&eacute;t&eacute;s du champ sont dupliqu&eacute;es mais le nouveau champ n&#39;est pas ajout&eacute; &agrave; la cl&eacute; primaire de la table parente.</p></div>
<h3 id="move">
D&eacute;placer des &eacute;l&eacute;ments</h3>
<p>Pour d&eacute;placer un &eacute;l&eacute;ment, cliquez sur la fl&egrave;che <img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img> situ&eacute;e &agrave; la droite de l&#39;&eacute;l&eacute;ment &agrave; d&eacute;placer et s&eacute;lectionnez &quot;D&eacute;placer&quot;. S&eacute;lectionnez ensuite la fl&egrave;che qui correspond &agrave; l&#39;&eacute;l&eacute;ment <em>avant lequel</em> positionner l&#39;&eacute;l&eacute;ment actuel.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Le d&eacute;placement d&#39;un &eacute;l&eacute;ment est uniquement possible au sein d&#39;un m&ecirc;me niveau dans la structure de donn&eacute;es du mod&egrave;le.</p></div>
<h2 id="reusableTypes">
Types r&eacute;utilisables</h2>
<p>Les types r&eacute;utilisables sont des &eacute;l&eacute;ments partag&eacute;s qui, apr&egrave;s leur cr&eacute;ation, peuvent &ecirc;tre r&eacute;utilis&eacute;s par diff&eacute;rents &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es.</p><div class="ebx_note">
<h5>
Note</h5>
<p>En modifiant la d&eacute;finition d&#39;un type r&eacute;utilisable, la structure de tous les &eacute;l&eacute;ments bas&eacute;s sur ce type r&eacute;utilisable est aussi modifi&eacute;e. L&#39;arborescence &quot;Structure de donn&eacute;es&quot; affiche, en lecture seule, la structure d&#39;un groupe ou d&#39;une table qui utilise un type r&eacute;utilisable. Pour &eacute;diter la structure du type r&eacute;utilisable associ&eacute;, acc&eacute;dez au type dans la section &quot;Types de donn&eacute;es simples&quot; ou &quot;Types de donn&eacute;es complexes&quot;.</p></div>
<h3 id="reusableDefine">
D&eacute;finition d&#39;un type r&eacute;utilisable</h3>
<p>En utilisant le menu avec la fl&egrave;che <img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img>des sections &quot;Types de donn&eacute;es simples&quot; ou &quot;Types de donn&eacute;es complexes&quot; dans le panneau de navigation, il est possible de cr&eacute;er des types simples et des types complexes r&eacute;utilisables qui seront disponibles pour cr&eacute;er d&#39;autres &eacute;l&eacute;ments avec la m&ecirc;me structure et les m&ecirc;mes propri&eacute;t&eacute;s. Il est &eacute;galement possible de convertir les tables et groupes existants en types r&eacute;utilisables en utilisant le menu avec la fl&egrave;che<img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img>situ&eacute; &agrave; c&ocirc;t&eacute; de l&#39;&eacute;l&eacute;ment &agrave; convertir.</p><p>Il est possible de visualiser les &eacute;l&eacute;ments du mod&egrave;le utilisant un type r&eacute;utilisable, en &eacute;ditant ce type et en cliquant sur le lien &quot;R&eacute;f&eacute;rences vers ce type&quot;. Ce lien affiche une table listant tous les &eacute;l&eacute;ments utilisant ce type. Si le type n&#39;est utilis&eacute; par aucun &eacute;l&eacute;ment, il peut &ecirc;tre supprim&eacute; en s&eacute;lectionnant &quot;Supprimer type&quot; en utilisant le menu avec la fl&egrave;che <img alt="/ebx_menu.png" src="../resources/images/symbols/ebx_menu.png" class="ebx_appButton"></img>situ&eacute; &agrave; droite du type &agrave; supprimer.</p><h3 id="reusableUse">
Utilisation d&#39;un type r&eacute;utilisable</h3>
<p>Les structures et les propri&eacute;t&eacute;s de nouveaux &eacute;l&eacute;ments peuvent &ecirc;tre d&eacute;finies par des types r&eacute;utilisables en s&eacute;lectionnant un type r&eacute;utilisable &agrave; la cr&eacute;ation d&#39;un &eacute;l&eacute;ment. L&#39;&eacute;l&eacute;ment cr&eacute;&eacute; utilisera la structure et les propri&eacute;t&eacute;s du type r&eacute;utilisable.</p><h3 id="includeDataModel">
Inclusion des types de donn&eacute;es d&eacute;finis dans d&#39;autres mod&egrave;les de donn&eacute;es</h3>
<p>Les types r&eacute;utilisables peuvent aussi &ecirc;tre partag&eacute;s entre plusieurs mod&egrave;les de donn&eacute;es. En configurant l&#39;inclusion d&#39;un mod&egrave;le de donn&eacute;es externe, il est possible d&#39;utiliser les types de donn&eacute;es inclus pour cr&eacute;er des &eacute;l&eacute;ments dans la structure de donn&eacute;es, de la m&ecirc;me mani&egrave;re que pour les types r&eacute;utilisables d&eacute;finis en local.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Les types de donn&eacute;es devant &ecirc;tre uniques pour tous les types d&eacute;finis en local et inclus, il n&#39;est pas possible de cr&eacute;er un type r&eacute;utilisable portant le m&ecirc;me nom qu&#39;un type de donn&eacute;es dans un mod&egrave;le de donn&eacute;es inclus. De la m&ecirc;me mani&egrave;re, il n&#39;est pas possible d&#39;inclure un mod&egrave;le de donn&eacute;es externe qui d&eacute;finit un type de donn&eacute;es portant le m&ecirc;me nom qu&#39;un type r&eacute;utilisable d&eacute;fini en local ou dans un autre mod&egrave;le de donn&eacute;es inclus.</p></div>
<p>Les types de donn&eacute;es inclus apparaissent dans les sections &quot;Types de donn&eacute;es simples inclus&quot; et &quot;Types de donn&eacute;es complexes inclus&quot; dans le panneau de navigation. Les d&eacute;tails de ces types r&eacute;utilisables sont consultables, mais ils ne sont &eacute;ditables que dans leurs mod&egrave;les de donn&eacute;es d&#39;origine.</p><p>Voir <a href="../user_datamodel/userdatamodel_configuring.html#includemodel">Mod&egrave;les de donn&eacute;es inclus</a> pour plus d&#39;informations.</p><h2 id="id3">
D&eacute;tails de la cr&eacute;ation des &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es</h2>
<h3 id="addfield">
Cr&eacute;ation de champs</h3>
<p>A la cr&eacute;ation d&#39;un champ, un type de donn&eacute;es doit &ecirc;tre s&eacute;lectionn&eacute;. Il d&eacute;finira le type de donn&eacute;es associ&eacute; aux valeurs saisies dans un jeu de donn&eacute;es bas&eacute; sur ce mod&egrave;le. Le type de donn&eacute;es du champ ne peut pas &ecirc;tre modifi&eacute; apr&egrave;s la cr&eacute;ation du champ.</p><p>Durant la cr&eacute;ation d&#39;un champ, il est &eacute;galement possible de le d&eacute;signer comme cl&eacute; &eacute;trang&egrave;re, champ obligatoire, ou comme cl&eacute; primaire si le champ est cr&eacute;&eacute; sous une table.</p><h3 id="addtable">
Cr&eacute;ation de tables</h3>
<p>Lors de la cr&eacute;ation d&#39;une nouvelle table, un type r&eacute;utilisable existant peut &ecirc;tre utilis&eacute; pour d&eacute;finir la structure et les propri&eacute;t&eacute;s de cette nouvelle table. Voir <a href="#reusableTypes">Types r&eacute;utilisables</a> pour plus d&#39;informations.</p><p>Chaque table n&eacute;cessite la d&eacute;signation d&#39;au moins un champ cl&eacute; primaire, qui peut &ecirc;tre cr&eacute;&eacute; comme un &eacute;l&eacute;ment enfant de la table dans la section &quot;Structure de donn&eacute;es&quot; du panneau de navigation.</p><h3 id="addgroup">
Cr&eacute;ation de groupes</h3>
<p>Lors de la cr&eacute;ation d&#39;un groupe, il est possible d&#39;utiliser un type r&eacute;utilisable existant pour d&eacute;finir la structure et les propri&eacute;t&eacute;s du nouveau groupe. Voir <a href="#reusableTypes">Types r&eacute;utilisables</a> pour plus d&#39;informations. </p><h3 id="addpkey">
Cr&eacute;ation de cl&eacute;s primaires</h3>
<p>Pour chaque table, il est n&eacute;cessaire de d&eacute;finir une cl&eacute; primaire. Pour cela, ajoutez un nouvel &eacute;l&eacute;ment enfant &agrave; partir du menu d&#39;actions disponible sur la table dans la section &quot;Structure de donn&eacute;es&quot; du panneau de navigation.</p><p id="definepkey">Il est aussi possible d&#39;ajouter un champ existant &agrave; la d&eacute;finition de la cl&eacute; primaire, sur l&#39;onglet &quot;Cl&eacute; primaire&quot; dans les &quot;Propri&eacute;t&eacute;s avanc&eacute;es&quot; de la table.</p><h3 id="addfkey">
Cr&eacute;ation ou d&eacute;finition de cl&eacute;s &eacute;trang&egrave;res</h3>
<p>Les champs associ&eacute;s &agrave; une cl&eacute; &eacute;trang&egrave;re sont de type &quot;Chaîne de caract&egrave;res&quot;. Pour cr&eacute;er une cl&eacute; &eacute;trang&egrave;re sur une table, ajoutez un nouvel &eacute;l&eacute;ment enfant &agrave; partir du menu d&#39;actions disponible sur la table dans la section &quot;Structure de donn&eacute;es&quot; du panneau de navigation. Il est &eacute;galement possible de d&eacute;finir directement les propri&eacute;t&eacute;s d&#39;une cl&eacute; &eacute;trang&egrave;re en &eacute;ditant un champ de type &quot;Chaîne de caract&egrave;res&quot;. Pour convertir un champ existant de type &quot;Chaîne de caract&egrave;res&quot; en cl&eacute; &eacute;trang&egrave;re, activez la propri&eacute;t&eacute; &quot;Contrainte de cl&eacute; &eacute;trang&egrave;re&quot; dans les &quot;Contr&ocirc;les avanc&eacute;s&quot; du champ et d&eacute;finissez les propri&eacute;t&eacute;s associ&eacute;es.</p><p>Il faut toujours sp&eacute;cifier la table r&eacute;f&eacute;renc&eacute;e par une cl&eacute; &eacute;trang&egrave;re.</p><h3 id="addAssociation">
Cr&eacute;ation d&#39;associations</h3>
<p>Une association permet de d&eacute;finir un lien s&eacute;mantique entre deux tables. Une association peut &ecirc;tre d&eacute;finie en cr&eacute;ant un &eacute;l&eacute;ment dans une table de la section &quot;Structure de donn&eacute;es&quot; du panneau de navigation en s&eacute;lectionnant la propri&eacute;t&eacute; &quot;association&quot; dans le formulaire de cr&eacute;ation. Une association peut uniquement &ecirc;tre cr&eacute;&eacute;e dans une table et il n&#39;est pas possible de convertir un champ existant en association. </p><p>Lors de la cr&eacute;ation d&#39;une association, sp&eacute;cifiez son type. Pour cela, diff&eacute;rentes options sont disponibles&nbsp;:&nbsp;</p><ul>
<li><p> Relation inverse d&#39;une <em>cl&eacute; &eacute;trang&egrave;re</em>. Dans ce cas, l&#39;association est d&eacute;finie dans une <em>table source</em> et fait r&eacute;f&eacute;rence &agrave; une <em>table cible</em>. Ce type d&#39;association est l&#39;inverse d&#39;une cl&eacute; &eacute;trang&egrave;re qui est d&eacute;finie dans la table cible et qui r&eacute;f&eacute;rence la table source. D&eacute;finissez la cl&eacute; &eacute;trang&egrave;re qui r&eacute;f&eacute;rence la table contenant l&#39;association. Pour cela, des assistants de saisie sont disponibles lors de la cr&eacute;ation de l&#39;association. </p></li><li><p> Utilisation d&#39;une <em>table de liens</em>. Dans ce cas, l&#39;association est d&eacute;finie dans une <em>table source</em> et fait r&eacute;f&eacute;rence &agrave; une <em>table cible</em> qui est inf&eacute;r&eacute;e &agrave; partir d&#39;une <em>table de liens</em>. Cette table de liens doit d&eacute;finir deux cl&eacute;s &eacute;trang&egrave;res&nbsp;:&nbsp;une cl&eacute; &eacute;trang&egrave;re r&eacute;f&eacute;ren&ccedil;ant la table source et une autre r&eacute;f&eacute;ren&ccedil;ant la table cible. La cl&eacute; primaire de la table de liens doit aussi &ecirc;tre compos&eacute;e de champs auto-incr&eacute;ment&eacute;s et/ou de cl&eacute;s &eacute;trang&egrave;res vers la table source ou cible de l&#39;association. D&eacute;finissez la table de liens et ces deux cl&eacute;s &eacute;trang&egrave;res. Pour cela, des assistants de saisie sont disponibles &agrave; la cr&eacute;ation de l&#39;association. </p></li><li><p> Utilisation d&#39;un <em>pr&eacute;dicat XPath</em>. Dans ce cas, l&#39;association est d&eacute;finie dans une <em>table source</em> et fait r&eacute;f&eacute;rence &agrave; une <em>table cible</em> sp&eacute;cifi&eacute; par un chemin <em>XPath</em>. Une <em>expression XPath</em> doit aussi &ecirc;tre d&eacute;finie afin de sp&eacute;cifier les crit&egrave;res qui permettent d&#39;associer un enregistrement de la table courante avec des enregistrements de la table cible. </p></li></ul>
<p>Pour ces types d&#39;association, nous appelons <em>enregistrements associ&eacute;s</em> les enregistrements de la table cible s&eacute;mantiquement li&eacute;s aux enregistrements de la table source. </p><p>Une fois l&#39;association cr&eacute;&eacute;e, il est possible de d&eacute;finir d&#39;autres propri&eacute;t&eacute;s&nbsp;:&nbsp;</p><ul>
<li><p>filtrer les enregistrements associ&eacute;s en d&eacute;finissant un filtre XPath. Il est uniquement possible d&#39;utiliser les champs de la table source et de la table cible lors de la d&eacute;finition du filtre XPath. Il n&#39;est donc pas possible d&#39;utiliser les champs d&#39;une table de liens dans un filtre XPath. Un assistant de saisie est disponible pour d&eacute;finir les champs &agrave; utiliser dans un filtre XPath. </p></li><li><p>configurer une vue tabulaire pour d&eacute;finir les champs de la table cible devant &ecirc;tre affich&eacute;s dans les formulaires des jeux de donn&eacute;es. Il n&#39;est pas possible de configurer ou de modifier une vue tabulaire si la table cible n&#39;est pas d&eacute;finie ou n&#39;existe pas. Par d&eacute;faut, tous les champs de la table cible qu&#39;un utilisateur a le droit de voir seront affich&eacute;s dans les jeux de donn&eacute;es si la vue tabulaire n&#39;est pas d&eacute;finie. </p></li><li><p>d&eacute;finir comment doivent &ecirc;tre pr&eacute;sent&eacute;s les enregistrements associ&eacute;s dans les formulaires des jeux de donn&eacute;es. Indiquez si les enregistrements associ&eacute;s doivent &ecirc;tre inclus dans le formulaire ou dans un onglet sp&eacute;cifique. Par d&eacute;faut, les enregistrements associ&eacute;s seront inclus dans le formulaire au niveau de l&#39;association dans le mod&egrave;le de donn&eacute;es. </p></li><li><p>inclure / exclure les enregistrements associ&eacute;s dans les op&eacute;rations de s&eacute;lection de Data Service. Par d&eacute;faut, les enregistrements ne sont pas inclus dans les op&eacute;rations de s&eacute;lection des Data Service. </p></li><li><p>sp&eacute;cifier les nombres minimum et maximum d&#39;enregistrements associ&eacute;s requis. Dans les jeux de donn&eacute;es associ&eacute;s, un message de validation est ajout&eacute; lorsque les nombres minimum ou maximum d&#39;enregistrements associ&eacute;s ne correspondent pas &agrave; ces crit&egrave;res. Par d&eacute;faut, les nombres minimum et maximum d&#39;enregistrements associ&eacute;s requis ne sont pas restreints. </p></li><li><p>d&eacute;finir une contrainte de validation en utilisant un pr&eacute;dicat XPath pour restreindre les enregistrements associ&eacute;s. Il est uniquement possible d&#39;utiliser les champs de la table source et de la table cible lors de la d&eacute;finition du pr&eacute;dicat XPath. Il n&#39;est donc pas possible d&#39;utiliser les champs d&#39;une table de liens dans un pr&eacute;dicat XPath. Un assistant de saisie permet de s&eacute;lectionner les champs &agrave; utiliser dans un pr&eacute;dicat XPath. Dans les jeux de donn&eacute;es associ&eacute;s, un message de validation sera ajout&eacute; pour tout enregistrement associ&eacute; ne v&eacute;rifiant pas cette contrainte. </p></li></ul>
<h2 id="id4">
Modification des &eacute;l&eacute;ments existants</h2>
<h3 id="removepkey">
Suppression d&#39;un champ de la cl&eacute; primaire</h3>
<p>Tout champ appartenant &agrave; la cl&eacute; primaire peut &ecirc;tre supprim&eacute; de la cl&eacute; primaire d&#39;une table sur l&#39;onglet &quot;Cl&eacute; primaire&quot; dans les &quot;Propri&eacute;t&eacute;s avanc&eacute;es&quot; de la table.</p><p>Voir <a href="../glossary/simple_glossary.html#pkey">cl&eacute; primaire</a> dans le glossaire.</p><p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a href="../table_contents_user.html"> Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Modèles de données &gt; Implémentation des modèles de données</span></div>
</div>
<p id="ebx_footer"><b>TIBCO EBX® Version 6.0.1. </b>Copyright &copy; <a href="https://www.tibco.com" target="_blank" style="text-decoration: none;">TIBCO&nbsp;Software&nbsp;Inc.</a> 2001-2021. All rights reserved.<br></br>All third party product and company names and third party marks mentioned in this document are the property of their respective owners and are mentioned for identification.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shCore.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushBash.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushCss.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushDiff.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJava.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJScript.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushPlain.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushProperties.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushSql.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushXml.js">
</script>
<script type="text/javaScript">
SyntaxHighlighter.all();</script>
</body>
</html>
