<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
TIBCO EBX® Documentation - Administration de workflows de donn&eacute;es</title>
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type"></meta><meta content="Copyright TIBCO Software Inc. 2001-2021. All rights reserved." name="copyright"></meta><meta content="workflow_administration" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="stylesheet" type="text/css" href="../resources/syntaxHighlighter/styles/shCoreEclipse.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
TIBCO EBX®</div>
<div class="chapterName">
Documentation &gt; Guide utilisateur &gt; Workflows de données &gt; Gestion de workflows de données</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" class="ebx_clickableIconLink" href="../index.html?page=user_dataworkflow/userdataworkflow_admin.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation" target="_top">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Workflows de données &gt; Gestion de workflows de données</span></div>
<h1>
Administration de workflows de donn&eacute;es</h1>
<p>Si vous disposez de permissions pour administrer des workflows de donn&eacute;es, les vues &#39;Publications&#39;, &#39;Workflows actifs&#39;, et &#39;Bons de travail&#39; associ&eacute;s seront accessibles sous le menu &#39;Monitoring&#39; du panneau de navigation. Dans ces vues, sous les menus &#39;Actions&#39; sur les lignes des tables, vous pourrez acc&eacute;der aux actions d&#39;administration.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Quand un mod&egrave;le de donn&eacute;es vous donne des droits d&#39;administration, vous aurez automatiquement les permissions de monitoring sur tous les objets associ&eacute;s &agrave; l&#39;ex&eacute;cution de workflow, comme les publications, les workflows actifs, et les bons de travail.</p></div>
<div id="toc">
<ul class="toc1">
<li class="toc1"><a href="#id1">Pr&eacute;sentation de l&#39;ex&eacute;cution de workflow de donn&eacute;es</a></li><li class="toc1"><a href="#id2">Actions d&#39;administration de workflow de donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#actions_publications">Actions sur les publications</a></li><li class="toc2"><a href="#actions_workflows">Actions sur workflows de donn&eacute;es</a></li></ul>
</li></ul>
</div>
<h2 id="id1">
Pr&eacute;sentation de l&#39;ex&eacute;cution de workflow de donn&eacute;es</h2>
<p>Quand un workflow de donn&eacute;es est lanc&eacute;, un <em>jeton</em> qui repr&eacute;sente l&#39;&eacute;tape en cours d&#39;ex&eacute;cution est cr&eacute;&eacute; et positionn&eacute; au d&eacute;but du workflow. A chaque fois qu&#39;une &eacute;tape est termin&eacute;e, ce jeton se d&eacute;place sur la prochaine &eacute;tape d&eacute;finie par le mod&egrave;le de workflow associ&eacute; &agrave; la publication du workflow de donn&eacute;es.</p><p>Pendant l&#39;ex&eacute;cution d&#39;un workflow de donn&eacute;es, le jeton est positionn&eacute; sur un des types d&#39;&eacute;tape suivants:</p><ul>
<li><p>une t&acirc;che automatique, qui est lanc&eacute;e automatiquement et n&#39;a pas besoin d&#39;interaction utilisateur. La t&acirc;che automatique est termin&eacute;e quand les actions d&eacute;finies finissent leur ex&eacute;cution.</p></li><li><p>une t&acirc;che utilisateur, qui g&eacute;n&egrave;re un ou plusieurs bons de travail effectu&eacute;s manuellement par les utilisateurs. Chaque bon de travail est termin&eacute; pas une action &#39;Accepter&#39; ou &#39;Rejeter&#39;, r&eacute;alis&eacute;e explicitement par l&#39;utilisateur. La fin de la t&acirc;che utilisateur chapeau est d&eacute;termin&eacute;e en fonction du crit&egrave;re de fin de t&acirc;che d&eacute;fini pour la t&acirc;che utilisateur dans le mod&egrave;le de workflow.</p></li><li><p>une condition, qui est &eacute;valu&eacute;e automatiquement afin de d&eacute;terminer l&#39;&eacute;tape suivante de l&#39;ex&eacute;cution du workflow de donn&eacute;es.</p></li><li><p>invocation de sous-workflows qui lance les sous-workflows associ&eacute;s et attend que les sous-workflows en cours soient termin&eacute;s.</p></li><li><p>t&acirc;che d&#39;attente qui met en pause le workflow jusqu&#39;&agrave; ce qu&#39;un &eacute;v&eacute;nement sp&eacute;cifique soit re&ccedil;u.</p></li></ul>
<p>Le jeton peut &ecirc;tre dans les &eacute;tats suivants :</p><ul>
<li><p><strong>A executer :</strong> Le jeton est en train de passer &agrave; la prochaine &eacute;tape, en se basant sur le mod&egrave;le de workflow.</p></li><li><p><strong>En cours d&#39;ex&eacute;cution :</strong> Le jeton est positionn&eacute; sur une t&acirc;che automatique ou une condition en train de s&#39;ex&eacute;cuter.</p></li><li><p><strong>Utilisateur :</strong> Le jeton est positionn&eacute; sur une t&acirc;che utilisateur et attend une action utilisateur.</p></li><li><p><strong>En attente de sous-workflows :</strong> Le jeton est positionn&eacute; sur une invocation de sous-workflows et attend la terminaison de tous les sous-workflows lanc&eacute;s.</p></li><li><p><strong>En attente d&#39;&eacute;v&eacute;nement :</strong>Le jeton est positionn&eacute; sur une t&acirc;che d&#39;attente et attend de recevoir un &eacute;v&eacute;nement donn&eacute;.</p></li><li><p><strong>Termin&eacute; :</strong> Le jeton a atteint la fin du workflow de donn&eacute;es.</p></li><li><p><strong>Erreur :</strong> Une erreur est survenue.</p></li></ul>
<div class="ebx_seealso">
<h5>
Voir aussi</h5>
<ul>
<li><a href="../engine/admin_workflow.html">Workflow management</a></li></ul>
</div>
<h2 id="id2">
Actions d&#39;administration de workflow de donn&eacute;es</h2>
<h3 id="actions_publications">
Actions sur les publications</h3>
<h4 id="disable">
D&eacute;sactivation d&#39;une publication de workflow</h4>
<p>Afin d&#39;&eacute;viter que de nouveaux workflows de donn&eacute;es soient lanc&eacute;s depuis une publication de workflow, vous pouvez d&eacute;sactiver la publication. S&eacute;lectionnez la vue &#39;Publications&#39; dans la panneau de navigation, puis s&eacute;lectionnez <em>Actions &gt; D&eacute;sactiver</em> sur la ligne de la publication cible.</p><p>Une fois d&eacute;sactiv&eacute;e, la publication n&#39;apparaîtra plus dans la vue &#39;Lanceurs de workflow&#39; des utilisateurs. Toutefois, les workflows de donn&eacute;es d&eacute;j&agrave; lanc&eacute;s vont continuer &agrave; s&#39;ex&eacute;cuter.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Suite &agrave; la d&eacute;sactivation d&#39;une publication, il n&#39;est pas possible de la r&eacute;activer &agrave; partir de la section &#39;Workflows de donn&eacute;es&#39;. Seul un utilisateur avec le r&ocirc;le built-in &#39;Administrateur&#39; peut r&eacute;activer une publication inactive dans la section &#39;Administration&#39;. Cependant, il n&#39;est pas conseill&eacute; de modifier les tables techniques manuellement, car il est important de pr&eacute;server l&#39;int&eacute;grit&eacute; des donn&eacute;es techniques des workflows.</p></div>
<h4>
D&eacute;publication d&#39;une publication de workflow</h4>
<p>Si une publication de workflow n&#39;est plus utilis&eacute;e, vous pouvez la supprimer de toutes les vues de la section &#39;Workflows de donn&eacute;es&#39; en la d&eacute;publiant. Pour faire cela,</p><ol>
<li><p>D&eacute;sactivez la publication de workflow afin d&#39;&eacute;viter que des utilisateurs continuent de lancer des nouveaux workflows de donn&eacute;es sur cette publication. Pour cela, suivez le processus d&eacute;crit dans la section <a href="#disable">D&eacute;sactivation d&#39;une publication de workflow</a>.</p></li><li><p>D&eacute;publier la publication de workflow en s&eacute;lectionnant <em>Actions &gt; D&eacute;publier</em> de la ligne de la publication cible.</p></li></ol>
<div class="ebx_note">
<h5>
Note</h5>
<p>A la d&eacute;publication d&#39;une publication de workflow, une confirmation vous sera demand&eacute;e pour terminer et purger tous les workflows de donn&eacute;es en cours qui ont &eacute;t&eacute; lanc&eacute;s depuis cette publication de workflow, ainsi que tout bon de travail associ&eacute;. Toute perte de donn&eacute;es r&eacute;sultant d&#39;une fin pr&eacute;matur&eacute;e est alors d&eacute;finitive.</p></div>
<h3 id="actions_workflows">
Actions sur workflows de donn&eacute;es</h3>
<p>Dans les vues tabulaires des workflows de donn&eacute;es, chaque enregistrement porte un menu <em>Actions</em> qui permet d’ex&eacute;cuter des services sur un workflow de donn&eacute;es.</p><h4>
R&eacute;-ex&eacute;cution d&#39;une &eacute;tape</h4>
<p>Dans le cas d&#39;une erreur inattendue pendant l&#39;ex&eacute;cution d&#39;une &eacute;tape, par exemple, &agrave; cause d&#39;un probl&egrave;me de permissions ou de ressources non disponibles, vous pouvez &quot;rejouer&quot; une &eacute;tape en tant qu&#39;administrateur de workflow. En rejouant une &eacute;tape, l&#39;environnement d&#39;ex&eacute;cution associ&eacute; est nettoy&eacute;, notamment les bons de travail et sous-workflows li&eacute;s, et le jeton est repositonn&eacute; au debut de l&#39;&eacute;tape courante.</p><p>Pour rejouer l&#39;&eacute;tape courante dans un workflow de donn&eacute;es, s&eacute;lectionnez <em>Actions &gt; Rejouer l&#39;&eacute;tape</em> dans la ligne du workflow cible dans la table &#39;Workflows actifs&#39;.</p><h4>
Terminer un workflow de donn&eacute;es actif et le purger</h4>
<p>Pour terminer un workflow de donn&eacute;es en cours d&#39;ex&eacute;cution, s&eacute;lectionnez <em>Actions &gt; Terminer et purger</em> dans la ligne du workflow cible dans la table &#39;Workflows actifs&#39;. L&#39;action stoppe l&#39;ex&eacute;cution du workflow de donn&eacute;es et supprime le workflow, tous les bons de travail et sous-workflows associ&eacute;s.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Cette action n&#39;est pas disponible pour les workflows dans l&#39;&eacute;tat &#39;En cours d&#39;ex&eacute;cution&#39; et pour les sous-workflows lanc&eacute;s par d&#39;autres workflows.</p></div>
<div class="ebx_note">
<h5>
Note</h5>
<p>Les historiques du workflow ne sont pas supprim&eacute;s.</p></div>
<h4>
Forcer la terminaison d&#39;un workflow de donn&eacute;es actif</h4>
<p>Pour forcer la terminaison d&#39;un workflow de donn&eacute;es en cours d&#39;ex&eacute;cution, s&eacute;lectionnez <em>Actions &gt;Forcer la terminaison</em> dans la ligne du workflow cible dans la table &#39;Workflows actifs&#39;. L&#39;action stoppe l&#39;ex&eacute;cution du workflow de donn&eacute;es et supprime les &eacute;ventuels bons de travail et sous-workflows associ&eacute;s.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Cette action est disponible pour les sous-workflows, et pour les workflows en erreur bloqu&eacute;s sur la derni&egrave;re &eacute;tape.</p></div>
<div class="ebx_note">
<h5>
Note</h5>
<p>Les historiques du workflow ne sont pas supprim&eacute;s.</p></div>
<h4>
Forcer le r&eacute;veil d&#39;un workflow en attente</h4>
<p>Pour r&eacute;veiller un workflow qui est en attente d&#39;&eacute;v&eacute;nement, s&eacute;lectionner <strong>Actions &gt; Forcer le r&eacute;veil</strong> &agrave; partir du workflow dans la table &#39;Workflows actifs&#39;. Cela entraîne le r&eacute;veil du workflow. Avant d&#39;effectuer cette action, l&#39;administrateur doit mettre &agrave; jour le contexte de donn&eacute;es afin de s&#39;assurer que le workflow peut ex&eacute;cuter les t&acirc;ches suivantes.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Cette action est disponible uniquement pour les workflows qui sont &agrave; l&#39;&eacute;tat &#39;en attente d&#39;&eacute;v&eacute;nement&#39;.</p></div>
<h4>
Purge d&#39;un workflow de donn&eacute;es termin&eacute;</h4>
<p>Quand un workflow de donn&eacute;es a termin&eacute; son ex&eacute;cution, son historique est visible pour ses superviseurs et administrateurs dans la vue &#39;Workflows termin&eacute;s&#39;. Pour purger le workflow termin&eacute;, vous pouvez effectuer un nettoyage en s&eacute;lectionnant <em>Actions &gt; Purger</em> dans la ligne du workflow cible de la table &#39;Workflows termin&eacute;s&#39;.</p><p>Un workflow purg&eacute; n’est plus visible dans la vue &#39;Workflows termin&eacute;s&#39;. Cependant, son historique reste consultable dans la zone d’administration technique.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Cette action n&#39;est pas disponible pour les sous-workflows lanc&eacute;s par d&#39;autres workflows.</p></div>
<div class="ebx_seealso">
<h5>
Voir aussi</h5>
<ul>
<li><a href="../engine/admin_workflow.html">Workflow management</a></li></ul>
</div>
<h4>
Modification de la priorit&eacute; d&#39;un workflow de donn&eacute;es</h4>
<p>Suite au lancement d&#39;un workflow de donn&eacute;es, un administrateur du workflow peut modifier son niveau de priorit&eacute;. En modifiant la priorit&eacute; du workflow de donn&eacute;es, la priorit&eacute; de tous les bons de travail existants et &agrave; venir de ce workflow sera modifi&eacute;e. Pour modifier la priorit&eacute; d&#39;un workflow de donn&eacute;es, s&eacute;lectionnez <em>Actions &gt; Modifier la priorit&eacute;</em> dans la ligne du workflow cible dans la table &#39;Workflows actifs&#39;.</p><div class="ebx_seealso">
<h5>
Voir aussi</h5>
<ul>
<li><a href="../user_workflowmodel/userworkflowmodel_actions.html#permissions">Permissions sur les workflows de donn&eacute;es associ&eacute;s</a></li></ul>
</div>
<p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a href="../table_contents_user.html"> Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Workflows de données &gt; Gestion de workflows de données</span></div>
</div>
<p id="ebx_footer"><b>TIBCO EBX® Version 6.0.1. </b>Copyright &copy; <a href="https://www.tibco.com" target="_blank" style="text-decoration: none;">TIBCO&nbsp;Software&nbsp;Inc.</a> 2001-2021. All rights reserved.<br></br>All third party product and company names and third party marks mentioned in this document are the property of their respective owners and are mentioned for identification.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shCore.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushBash.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushCss.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushDiff.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJava.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJScript.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushPlain.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushProperties.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushSql.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushXml.js">
</script>
<script type="text/javaScript">
SyntaxHighlighter.all();</script>
</body>
</html>
