<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
TIBCO EBX® Documentation - Glossaire</title>
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type"></meta><meta content="Copyright TIBCO Software Inc. 2001-2021. All rights reserved." name="copyright"></meta><meta content="simple_glossary" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="stylesheet" type="text/css" href="../resources/syntaxHighlighter/styles/shCoreEclipse.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
TIBCO EBX®</div>
<div class="chapterName">
Documentation &gt; Guide utilisateur &gt; Introduction</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" class="ebx_clickableIconLink" href="../index.html?page=glossary/simple_glossary.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation" target="_top">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Introduction</span></div>
<h1>
Glossaire</h1>
<div id="toc">
<ul class="toc1">
<li class="toc1"><a href="#interface">Gouvernance</a><ul class="toc2">
<li class="toc2"><a href="#repository">r&eacute;f&eacute;rentiel</a></li><li class="toc2"><a href="#profile">profil</a></li><li class="toc2"><a href="#user">utilisateur</a></li><li class="toc2"><a href="#role">r&ocirc;le</a></li></ul>
</li><li class="toc1"><a href="#datamodels">Mod&eacute;lisation de donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#datamodel">mod&egrave;le de donn&eacute;es</a></li><li class="toc2"><a href="#field">champ</a></li><li class="toc2"><a href="#pkey">cl&eacute; primaire</a></li><li class="toc2"><a href="#fkey">cl&eacute; &eacute;trang&egrave;re</a></li><li class="toc2"><a href="#tableindatamodel">table (mod&egrave;le de donn&eacute;es)</a></li><li class="toc2"><a href="#group">groupe</a></li><li class="toc2"><a href="#reusabletype">type r&eacute;utilisable</a></li><li class="toc2"><a href="#validation">r&egrave;gle de validation</a></li><li class="toc2"><a href="#id2s9">assistant de mod&eacute;lisation de donn&eacute;es (DMA)</a></li></ul>
</li><li class="toc1"><a href="#data">Gestion des donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#record">enregistrement</a></li><li class="toc2"><a href="#tableindataset">table (jeu de donn&eacute;es)</a></li><li class="toc2"><a href="#dataset">jeu de donn&eacute;es</a></li><li class="toc2"><a href="#inheritance">h&eacute;ritage</a></li><li class="toc2"><a href="#customtableview">vues</a></li><li class="toc2"><a href="#id3s6">vue recommand&eacute;e</a></li><li class="toc2"><a href="#id3s7">vue favorite</a></li></ul>
</li><li class="toc1"><a href="#dataspaces">Cycle de vie des donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#dataspace">espace de donn&eacute;es</a></li><li class="toc2"><a href="#refdataspace">espace de donn&eacute;es de r&eacute;f&eacute;rence</a></li><li class="toc2"><a href="#merge">fusion</a></li><li class="toc2"><a href="#snapshot">image</a></li></ul>
</li><li class="toc1"><a href="#history">Historique</a><ul class="toc2">
<li class="toc2"><a href="#historization">historisation</a></li><li class="toc2"><a href="#historyprofile">profil d&#39;historisation</a></li><li class="toc2"><a href="#historyTableView">vue historique de table</a></li><li class="toc2"><a href="#historyTransactionView">vue historique des transactions</a></li></ul>
</li><li class="toc1"><a href="#workflowmodels">Mod&eacute;lisation de workflow</a><ul class="toc2">
<li class="toc2"><a href="#workflowmodel">mod&egrave;le de workflow</a></li><li class="toc2"><a href="#scripttask">t&acirc;che automatique</a></li><li class="toc2"><a href="#usertask">t&acirc;che utilisateur</a></li><li class="toc2"><a href="#condition">condition de workflow</a></li><li class="toc2"><a href="#subworkflow">appel &agrave; des sous-workflows</a></li><li class="toc2"><a href="#waitTask">t&acirc;che d&#39;attente</a></li><li class="toc2"><a href="#datacontext">contexte des donn&eacute;es</a></li></ul>
</li><li class="toc1"><a href="#workflows">Workflows de donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#workflowpub">publication de workflow</a></li><li class="toc2"><a href="#workflow">workflow de donn&eacute;es</a></li><li class="toc2"><a href="#worklist">corbeille</a></li><li class="toc2"><a href="#workitem">bon de travail</a></li></ul>
</li><li class="toc1"><a href="#dataservices">Services de donn&eacute;es</a><ul class="toc2">
<li class="toc2"><a href="#dataservice">service de donn&eacute;es</a></li><li class="toc2"><a href="#lineage">lignage</a></li></ul>
</li><li class="toc1"><a href="#miscellaneous">Transverse</a><ul class="toc2">
<li class="toc2"><a href="#node">noeud</a></li></ul>
</li></ul>
</div>
<h2 id="interface">
Gouvernance</h2>
<h3 id="repository">
r&eacute;f&eacute;rentiel</h3>
<p>Entit&eacute; de stockage c&ocirc;t&eacute; serveur contenant toutes les donn&eacute;es g&eacute;r&eacute;es par TIBCO EBX&reg;. Le r&eacute;f&eacute;rentiel est organis&eacute; en espaces de donn&eacute;es.</p><p>Voir <a href="#dataspace">espace de donn&eacute;es</a>.</p><h3 id="profile">
profil</h3>
<p>Terme g&eacute;n&eacute;rique d&eacute;signant soit un utilisateur, soit un r&ocirc;le. Les profils sont utilis&eacute;s pour d&eacute;finir des r&egrave;gles de permission et des workflows de donn&eacute;es.</p><p> Voir <a href="#user">utilisateur</a>, <a href="#role">r&ocirc;le</a>.</p><h3 id="user">
utilisateur</h3>
<p>Entit&eacute; cr&eacute;&eacute;e dans le r&eacute;f&eacute;rentiel afin de permettre &agrave; des personnes physiques ou des syst&egrave;mes externes de s&#39;authentifier et d&#39;acc&eacute;der &agrave; EBX&reg;. Un utilisateur peut avoir un ou plusieurs r&ocirc;les et poss&eacute;der diverses informations de compte telles que nom, pr&eacute;nom, login, e-mail, etc.</p><h3 id="role">
r&ocirc;le</h3>
<p>Classification d&#39;utilisateur utilis&eacute;e pour les r&egrave;gles de permission et les workflows de donn&eacute;es. Chaque utilisateur peut appartenir &agrave; plusieurs r&ocirc;les.</p><p>D&egrave;s qu&#39;un profil de type r&ocirc;le est configur&eacute; dans EBX&reg;, le comportement r&eacute;sultant de cette configuration s&#39;applique &agrave; tous les utilisateurs membres de ce r&ocirc;le. Par exemple, dans un mod&egrave;le de workflow, un r&ocirc;le peut &ecirc;tre configur&eacute; pour le(s) destinataire(s) d&#39;un bon de travail.</p><h2 id="datamodels">
Mod&eacute;lisation de donn&eacute;es</h2>
<p><em>Section de la documentation <a href="../user_datamodel/userdatamodel_intro.html">Mod&egrave;les de donn&eacute;es</a></em></p><h3 id="datamodel">
mod&egrave;le de donn&eacute;es</h3>
<p>D&eacute;finition structur&eacute;e des donn&eacute;es &agrave; g&eacute;rer dans le r&eacute;f&eacute;rentiel EBX&reg;. Un mod&egrave;le de donn&eacute;es d&eacute;crit la structure des donn&eacute;es en termes d&#39;organisation, de type et de relations s&eacute;mantiques. Le but d&#39;un mod&egrave;le de donn&eacute;es est de d&eacute;finir la structure et les caract&eacute;ristiques d&#39;un jeu de donn&eacute;es, qui est une instance d&#39;un mod&egrave;le de donn&eacute;es contenant les donn&eacute;es g&eacute;r&eacute;es par le r&eacute;f&eacute;rentiel.</p><p>Voir <a href="#dataset">jeu de donn&eacute;es</a>.</p><p>Concept apparent&eacute; : <a href="../user_datamodel/userdatamodel_intro.html">Mod&egrave;les de donn&eacute;es</a>.</p><h3 id="field">
champ</h3>
<p>El&eacute;ment de base du mod&egrave;le de donn&eacute;es d&eacute;fini par un nom et un type de donn&eacute;es simple. Un champ peut &ecirc;tre directement d&eacute;fini &agrave; la racine du mod&egrave;le de donn&eacute;es, ou en tant que colonne d&#39;une table. Il est possible d&#39;assigner des contraintes de base sur la valeur du champ, par exemple sur sa longueur, ainsi que des r&egrave;gles de validation plus complexes impliquant des calculs. La valeur du champ peut &ecirc;tre automatiquement calcul&eacute;e &agrave; l&#39;aide du m&eacute;canisme d&#39;h&eacute;ritage de donn&eacute;es, ou de r&egrave;gles de calcul. Un champ peut &ecirc;tre d&eacute;fini comme &eacute;tant une liste agr&eacute;g&eacute;e en sp&eacute;cifiant une cardinalit&eacute; maximale sup&eacute;rieure &agrave; 1. Chaque &eacute;l&eacute;ment de la liste ainsi d&eacute;finie sera du m&ecirc;me type que le champ initial. Les champs peuvent &ecirc;tre regroup&eacute;s pour faciliter l&#39;organisation du mod&egrave;le de donn&eacute;es. </p><p>Par d&eacute;faut, les champs sont repr&eacute;sent&eacute;s par l&#39;ic&ocirc;ne <img alt="/ebx_attribute.png" src="../resources/images/symbols/ebx_attribute.png"></img>.</p><p>Voir <a href="#record">enregistrement</a>, <a href="#group">groupe</a>, <a href="#tableindatamodel">table (mod&egrave;le de donn&eacute;es)</a>, <a href="#validation">r&egrave;gle de validation</a>, <a href="#inheritance">h&eacute;ritage</a>.</p><p>Concept apparent&eacute; : <a href="../user_datamodel/userdatamodel_elementproperties.html">Propri&eacute;t&eacute;s des &eacute;l&eacute;ments de structure</a>, <a href="../user_datamodel/userdatamodel_elementcontrols.html">Contr&ocirc;les sur les champs de donn&eacute;es</a>.</p><p>L&#39;ancien nom (avant la version 5) de &quot;champ&quot; &eacute;tait &quot;attribute&quot;.</p><h3 id="pkey">
cl&eacute; primaire</h3>
<p>Champ ou composition de plusieurs champs identifiant de mani&egrave;re unique un enregistrement dans une table. </p><p>Les cl&eacute;s primaires sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_pkey.png" src="../resources/images/symbols/ebx_pkey.png"></img>.</p><h3 id="fkey">
cl&eacute; &eacute;trang&egrave;re</h3>
<p>Champ ou composition de plusieurs champs r&eacute;f&eacute;ren&ccedil;ant un enregistrement d&#39;une autre table, via sa cl&eacute; primaire. </p><p>Les cl&eacute;s &eacute;trang&egrave;res sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_fkey.png" src="../resources/images/symbols/ebx_fkey.png"></img>.</p><p>Voir <a href="#pkey">cl&eacute; primaire</a>.</p><h3 id="tableindatamodel">
table (mod&egrave;le de donn&eacute;es)</h3>
<p>El&eacute;ment du mod&egrave;le de donn&eacute;es compos&eacute; de champs et/ou de groupes. Une table doit au moins &ecirc;tre compos&eacute;e d&#39;un champ d&eacute;fini comme &eacute;tant une cl&eacute; primaire. Une table peut &ecirc;tre utilis&eacute;e pour la cr&eacute;ation d&#39;un type r&eacute;utilisable, afin de cr&eacute;er d&#39;autres &eacute;l&eacute;ments bas&eacute;s sur la structure de cette table.</p><p>Les tables sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_table.png" src="../resources/images/symbols/ebx_table.png"></img>.</p><p>Voir <a href="#record">enregistrement</a>, <a href="#pkey">cl&eacute; primaire</a>, <a href="#reusabletype">type r&eacute;utilisable</a>.</p><h3 id="group">
groupe</h3>
<p> Entit&eacute; de classification utilis&eacute;e pour organiser les donn&eacute;es du mod&egrave;le. Un groupe peut contenir des champs, d&#39;autres groupes, et des tables. Si un groupe contient des tables, alors celui-ci ne pourra pas &ecirc;tre inclus dans une autre table. Un groupe peut &ecirc;tre utilis&eacute; pour la cr&eacute;ation d&#39;un type r&eacute;utilisable afin de cr&eacute;er d&#39;autres &eacute;l&eacute;ments bas&eacute;s sur la structure de ce groupe.</p><p>Les groupes sont repr&eacute;sent&eacute;s par l&#39;ic&ocirc;ne <img alt="/ebx_group.png" src="../resources/images/symbols/ebx_group.png"></img>.</p><p>Voir <a href="#reusabletype">type r&eacute;utilisable</a>.</p><h3 id="reusabletype">
type r&eacute;utilisable</h3>
<p>D&eacute;finition d&#39;un type simple ou complexe qui peut &ecirc;tre partag&eacute;e entre diff&eacute;rents &eacute;l&eacute;ments d&#39;un mod&egrave;le.</p><h3 id="validation">
r&egrave;gle de validation</h3>
<p> Association d&#39;une ou plusieurs r&egrave;gles de contr&ocirc;le d&eacute;finies sur un champ ou une table. Toute donn&eacute;e saisie ne respectant pas ces contr&ocirc;les sera d&eacute;clar&eacute;e invalide, selon la s&eacute;v&eacute;rit&eacute; associ&eacute;e &agrave; la r&egrave;gle de validation.</p><p>L&#39;ancien nom (avant la version 5) de &quot;r&egrave;gle de validation&quot; &eacute;tait &quot;constraint&quot;.</p><h3 id="id2s9">
assistant de mod&eacute;lisation de donn&eacute;es (DMA)</h3>
<p>L&#39;interface utilisateur inclut un outil d&#39;aide &agrave; la mod&eacute;lisation des donn&eacute;es. Cet outil permet de d&eacute;finir la structure d&#39;un mod&egrave;le, de cr&eacute;er et &eacute;diter ses &eacute;l&eacute;ments, puis de configurer et publier le mod&egrave;le.</p><p>Voir <a href="../user_datamodel/userdatamodel_intro.html">Mod&egrave;les de donn&eacute;es</a>.</p><h2 id="data">
Gestion des donn&eacute;es</h2>
<p><em>Section de la documentation <a href="../user_data/userdata_intro.html">Jeux de donn&eacute;es</a></em></p><h3 id="record">
enregistrement</h3>
<p>Ensemble de donn&eacute;es identifi&eacute; de mani&egrave;re unique par une cl&eacute; primaire. Un enregistrement correspond &agrave; une ligne dans une table. Chaque enregistrement respecte la structure de donn&eacute;es d&eacute;finie dans le mod&egrave;le de donn&eacute;es associ&eacute;. C&#39;est ce mod&egrave;le de donn&eacute;es qui indique les types et les cardinalit&eacute;s des champs qui composent l&#39;enregistrement.</p><p>Voir <a href="#tableindataset">table (jeu de donn&eacute;es)</a>, <a href="#pkey">cl&eacute; primaire</a>.</p><p> L&#39;ancien nom (avant la version 5) pour &quot;enregistrement&quot; &eacute;tait &quot;occurrence&quot;.</p><h3 id="tableindataset">
table (jeu de donn&eacute;es)</h3>
<p>Ensemble d&#39;enregistrements (lignes) de m&ecirc;me structure contenant des donn&eacute;es. Chaque enregistrement est identifi&eacute; de mani&egrave;re unique par sa cl&eacute; primaire.</p><p>Les tables sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_table.png" src="../resources/images/symbols/ebx_table.png"></img>.</p><p>Voir <a href="#record">enregistrement</a>, <a href="#pkey">cl&eacute; primaire</a>.</p><h3 id="dataset">
jeu de donn&eacute;es</h3>
<p>Instance d&#39;un mod&egrave;le de donn&eacute;es qui contient les donn&eacute;es. La structure et le comportement d&#39;un jeu de donn&eacute;es sont bas&eacute;s sur les d&eacute;finitions fournies par le mod&egrave;le de donn&eacute;es qu&#39;il impl&eacute;mente. En fonction de son mod&egrave;le de donn&eacute;es, un jeu de donn&eacute;es peut contenir des donn&eacute;es sous la forme de tables, groupes et champs.</p><p>Voir <a href="#tableindataset">table (jeu de donn&eacute;es)</a>, <a href="#field">champ</a>, <a href="#group">groupe</a>, <a href="#customtableview">vues</a>.</p><p>Les jeux de donn&eacute;es sont represent&eacute;s par l&#39;ic&ocirc;ne <img alt="/ebx_instance.png" src="../resources/images/symbols/ebx_instance.png"></img>.</p><p>Concept apparent&eacute; : <a href="../user_data/userdata_intro.html">Jeux de donn&eacute;es</a>.</p><p>L&#39;ancien nom (avant la version 5) de &quot;jeu de donn&eacute;es&quot; &eacute;tait &quot;adaptation instance&quot;.</p><h3 id="inheritance">
h&eacute;ritage</h3>
<p>M&eacute;canisme par lequel une donn&eacute;e d&#39;une entit&eacute; peut &ecirc;tre valoris&eacute;e par d&eacute;faut &agrave; partir d&#39;une autre entit&eacute;. Dans EBX&reg;, deux types d&#39;h&eacute;ritage sont possibles&nbsp;:&nbsp;le premier entre deux jeux de donn&eacute;es, le deuxi&egrave;me entre deux champs.</p><p>Lorsqu&#39;il est activ&eacute;, l&#39;h&eacute;ritage entre jeux de donn&eacute;es permet &agrave; un jeu de donn&eacute;es enfant d&#39;obtenir comme valeur par d&eacute;faut les donn&eacute;es du jeu de donn&eacute;es parent. Il est possible de surcharger dans les jeux de donn&eacute;es enfants les valeurs h&eacute;rit&eacute;es du parent. Par d&eacute;faut, l&#39;h&eacute;ritage est d&eacute;sactiv&eacute;. Il peut &ecirc;tre activ&eacute; lors de la d&eacute;finition du mod&egrave;le de donn&eacute;es.</p><p>L&#39;h&eacute;ritage depuis le jeu de donn&eacute;es parent est repr&eacute;sent&eacute; par l&#39;ic&ocirc;ne <img alt="/ebx_setInherited.png" src="../resources/images/symbols/ebx_setInherited.png"></img>.</p><p>L&#39;h&eacute;ritage de champ fonctionne de mani&egrave;re similaire, mais s&#39;applique entre champs d&#39;un m&ecirc;me jeu de donn&eacute;es. Le champ h&eacute;rit&eacute; prend pour valeur par d&eacute;faut la valeur du champ source.</p><p>Les champs h&eacute;rit&eacute;s sont repr&eacute;sent&eacute;s par l&#39;ic&ocirc;ne <img alt="/ebx_setINA.png" src="../resources/images/symbols/ebx_setINA.png"></img>.</p><h3 id="customtableview">
vues</h3>
<p>Configuration d&#39;affichage applicable sur une table. Une vue peut &ecirc;tre cr&eacute;&eacute;e pour un utilisateur ou un r&ocirc;le et permet de sp&eacute;cifier notamment sous quel mode seront affich&eacute;s les enregistrements&nbsp;:&nbsp;hi&eacute;rarchique ou tabulaire ; ainsi que de d&eacute;finir des crit&egrave;res de filtrage et de tri.</p><p>Le mode de vue hi&eacute;rarchique pr&eacute;sente les donn&eacute;es d&#39;une table sous forme d&#39;arbre. Cette vue est utilis&eacute;e pour montrer les relations entre les donn&eacute;es du mod&egrave;le. Lors de la cr&eacute;ation d&#39;une vue hi&eacute;rarchique, une dimension doit &ecirc;tre s&eacute;lectionn&eacute;e pour d&eacute;terminer les relations &agrave; exploiter. Dans une vue hi&eacute;rarchique, il est possible de naviguer &agrave; travers des relations r&eacute;cursives, ainsi qu&#39;entre plusieurs tables en utilisant des cl&eacute;s &eacute;trang&egrave;res.</p><div class="ebx_seealso">
<h5>
Voir aussi</h5>
<ul>
<li><a href="../user_data/userdata_viewing.html#custom">Vues</a></li><li><a href="../user_data/userdata_viewing.html#hierarchies">Hi&eacute;rarchies</a></li></ul>
</div>
<h3 id="id3s6">
vue recommand&eacute;e</h3>
<p>Une vue recommand&eacute;e peut &ecirc;tre d&eacute;finie par le propri&eacute;taire d&#39;un jeu de donn&eacute;es pour chaque profil cible. Quand un utilisateur se connecte sans sp&eacute;cifier de vue, la vue recommand&eacute;e, si elle existe, s&#39;applique. Sinon, la vue par d&eacute;faut s&#39;affiche. </p><p>L&#39;action &#39;G&eacute;rer les vues recommand&eacute;es&#39; permet de d&eacute;finir les r&egrave;gles d&#39;attribution des vues recommand&eacute;es par utilisateur et par r&ocirc;le.</p><p>Concept apparent&eacute; : <a href="../user_data/userdata_viewing.html#preferred_views">Vues recommand&eacute;es</a>.</p><h3 id="id3s7">
vue favorite</h3>
<p>Lors de la consultation d&#39;une table, l&#39;utilisateur peut choisir de d&eacute;finir la vue actuelle comme sa vue favorite via la barre d&#39;outils du menu &#39;Vue&#39;. </p><p>Une fois d&eacute;finie comme favorite, la vue s&#39;appliquera automatiquement pour cet utilisateur lors de chaque acc&egrave;s &agrave; la table.</p><p>Concept apparent&eacute; : <a href="../user_data/userdata_viewing.html#view_menu_toolbar">Barre d&#39;outils du menu &#39;Vue&#39;</a>.</p><h2 id="dataspaces">
Cycle de vie des donn&eacute;es</h2>
<p><em>Section de la documentation <a href="../user_dataspace/userdataspace_intro.html">Espaces de donn&eacute;es</a></em></p><h3 id="dataspace">
espace de donn&eacute;es</h3>
<p>Contient les jeux de donn&eacute;es. L&#39;espace de donn&eacute;es est utilis&eacute; pour isoler diff&eacute;rentes versions de jeux de donn&eacute;es ou pour les organiser. Des espaces de donn&eacute;es enfants peuvent &ecirc;tre cr&eacute;&eacute;s &agrave; partir d&#39;un espace de donn&eacute;es. Un espace de donn&eacute;es enfant est initialis&eacute; dans le m&ecirc;me &eacute;tat que son parent au moment de sa cr&eacute;ation. Ult&eacute;rieurement, l&#39;enfant pourra &ecirc;tre fusionn&eacute; avec son parent. A tout moment, une comparaison avec d&#39;autres espaces de donn&eacute;es est possible.</p><p>Voir <a href="#inheritance">h&eacute;ritage</a>, <a href="#repository">r&eacute;f&eacute;rentiel</a>, <a href="#merge">fusion</a>.</p><p>Concept apparent&eacute; : <a href="../user_dataspace/userdataspace_intro.html">Dataspaces</a>.</p><p>L&#39;ancien nom (avant la version 5) pour &quot;espace de donn&eacute;es&quot; &eacute;tait &quot;branch&quot; ou &quot;snapshot&quot;.</p><h3 id="refdataspace">
espace de donn&eacute;es de r&eacute;f&eacute;rence</h3>
<p>Anc&ecirc;tre commun des espaces de donn&eacute;es du r&eacute;f&eacute;rentiel. N&#39;ayant pas de parent, cet espace de donn&eacute;es ne peut pas &ecirc;tre fusionn&eacute;. </p><p>Voir <a href="#dataspace">espace de donn&eacute;es</a>, <a href="#merge">fusion</a>, <a href="#repository">r&eacute;f&eacute;rentiel</a>.</p><h3 id="merge">
fusion</h3>
<p>Int&eacute;gration, dans l&#39;espace de donn&eacute;es parent, des changements r&eacute;alis&eacute;s dans un espace de donn&eacute;es enfant depuis sa cr&eacute;ation. L&#39;espace de donn&eacute;es enfant est ferm&eacute; apr&egrave;s une fusion r&eacute;alis&eacute;e avec succ&egrave;s. Pour effectuer cette fusion, un passage en revue des diff&eacute;rences entre les deux espaces de donn&eacute;es est requis afin de r&eacute;soudre les &eacute;ventuels conflits. En effet, des conflits peuvent survenir en cas de modification des m&ecirc;mes donn&eacute;es tant sur l&#39;enfant que le parent. Une d&eacute;cision doit &ecirc;tre prise pour chacun de ces conflits, afin de d&eacute;terminer quelle modification doit prendre le pas sur l&#39;autre. </p><p>Concept apparent&eacute; : <a href="../user_dataspace/userdataspace_actions.html#merge">Fusion</a>.</p><h3 id="snapshot">
image</h3>
<p>Copie statique d&#39;un espace de donn&eacute;es qui capture son &eacute;tat et tout son contenu &agrave; un moment donn&eacute;, afin d&#39;&ecirc;tre utilis&eacute;e comme r&eacute;f&eacute;rence. Une image peut &ecirc;tre consult&eacute;e, export&eacute;e, et compar&eacute;e &agrave; d&#39;autres espaces de donn&eacute;es, mais jamais modifi&eacute;e directement.</p><p>Les images sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_snapshot.png" src="../resources/images/symbols/ebx_snapshot.png"></img>.</p><p>Concept apparent&eacute; : <a href="../user_dataspace/userdataspace_snapshot.html">Image</a></p><p>L&#39;ancien nom (avant la version 5) pour &quot;image&quot; &eacute;tait &quot;version&quot; ou &quot;home&quot;.</p><h2 id="history">
Historique</h2>
<h3 id="historization">
historisation</h3>
<p>M&eacute;canisme qui peut &ecirc;tre activ&eacute; au niveau d&#39;une table afin de suivre les modifications dans le r&eacute;f&eacute;rentiel. Deux vues d&#39;historique sont disponibles quand l&#39;historisation est activ&eacute;e : la vue historique de table et la vue historique des transactions. Dans toutes les vues d&#39;historique, les fonctionnalit&eacute;s classiques des tables telles que l&#39;export, la comparaison et les filtres restent disponibles.</p><p>L&#39;activation de l&#39;historique n&eacute;cessite la configuration d&#39;un profil d&#39;historisation. L&#39;historisation des tables n&#39;est pas activ&eacute;e par d&eacute;faut.</p><p>Voir <a href="#historyTableView">vue historique de table</a>, <a href="#historyTransactionView">vue historique des transactions</a>, <a href="#historyprofile">profil d&#39;historisation</a>.</p><h3 id="historyprofile">
profil d&#39;historisation</h3>
<p>Ensemble de pr&eacute;f&eacute;rences sp&eacute;cifiant d&#39;une part les espaces de donn&eacute;es dont les modifications doivent &ecirc;tre enregistr&eacute;es dans l&#39;historique de la table et, d&#39;autre part, si les transactions doivent &eacute;chouer quand l&#39;historisation n&#39;est pas disponible.</p><p>Voir <a href="#historyprofile">profil d&#39;historisation</a>.</p><h3 id="historyTableView">
vue historique de table</h3>
<p>Vue contenant la trace de toutes les modifications effectu&eacute;es sur une table donn&eacute;e, notamment les cr&eacute;ations, mises &agrave; jour et suppressions. Chaque entr&eacute;e pr&eacute;sente les informations transactionnelles telles que&nbsp;:&nbsp;la date et l&#39;heure, l&#39;utilisateur ayant effectu&eacute; l&#39;action, ainsi que l&#39;&eacute;tat des donn&eacute;es &agrave; l&#39;issue de la transaction. Ces informations peuvent aussi &ecirc;tre consult&eacute;es au niveau d&#39;un enregistrement ou d&#39;un jeu de donn&eacute;es.</p><h3 id="historyTransactionView">
vue historique des transactions</h3>
<p>Vue pr&eacute;sentant les donn&eacute;es techniques et d&#39;authentification des transactions au niveau du r&eacute;f&eacute;rentiel ou d&#39;un espace de donn&eacute;es. Etant donn&eacute; qu&#39;une transaction peut effectuer de multiples op&eacute;rations/actions et peut affecter plusieurs tables dans un ou plusieurs jeux de donn&eacute;es, cette vue montre toutes les op&eacute;rations qui ont &eacute;t&eacute; effectu&eacute;es dans le p&eacute;rim&egrave;tre en question pour chaque transaction.</p><h2 id="workflowmodels">
Mod&eacute;lisation de workflow</h2>
<p><em>Section de la documentation <a href="../user_workflowmodel/userworkflowmodel_intro.html">Mod&egrave;les de workflow</a></em></p><h3 id="workflowmodel">
mod&egrave;le de workflow</h3>
<p>D&eacute;finition de la succession d&#39;op&eacute;rations &agrave; effectuer sur les donn&eacute;es.</p><p>Un mod&egrave;le de workflow de donn&eacute;es d&eacute;crit la totalit&eacute; du parcours que doivent suivre les donn&eacute;es pour &ecirc;tre trait&eacute;es, que ce soit en termes d&#39;&eacute;tats ou d&#39;actions associ&eacute;es &agrave; effectuer par des utilisateurs et des t&acirc;ches automatiques.</p><p>Concept apparent&eacute; : <a href="../user_workflowmodel/userworkflowmodel_intro.html">Mod&egrave;les de workflow</a>.</p><p>L&#39;ancien nom (avant la version 5) de &quot;mod&egrave;le de workflow&quot; &eacute;tait &quot;workflow definition&quot;.</p><p> Les mod&egrave;les de workflows sont repr&eacute;sent&eacute;s par l&#39;ic&ocirc;ne <img alt="/ebx_workflowGraphIcon.svg" src="../resources/images/symbols/ebx_workflowGraphIcon.svg"></img>. </p><h3 id="scripttask">
t&acirc;che automatique</h3>
<p>T&acirc;che de workflow de donn&eacute;es effectu&eacute;e par une proc&eacute;dure automatique, sans intervention humaine.</p><p>Les t&acirc;ches automatiques les plus communes sont la cr&eacute;ation d&#39;espace de donn&eacute;es, la fusion d&#39;espace de donn&eacute;es et la cr&eacute;ation d&#39;image.</p><p>Les t&acirc;ches automatiques sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_workflowScript.svg" src="../resources/images/symbols/ebx_workflowScript.svg"></img>.</p><p>Voir <a href="#workflowmodel">mod&egrave;le de workflow</a>.</p><h3 id="usertask">
t&acirc;che utilisateur</h3>
<p>T&acirc;che de workflow compos&eacute;e d&#39;un ou plusieurs bons de travail r&eacute;alis&eacute;s en parall&egrave;le par des utilisateurs (intervention humaine).</p><p>Les bons de travail sont propos&eacute;s ou assign&eacute;s aux utilisateurs, en fonction du mod&egrave;le de workflow de donn&eacute;es. L&#39;avancement du workflow de donn&eacute;es positionn&eacute; sur une t&acirc;che utilisateur d&eacute;pend de la satisfaction du crit&egrave;re de fin de t&acirc;che d&eacute;fini dans le mod&egrave;le de workflow de donn&eacute;es.</p><p>Les t&acirc;ches utilisateur sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_workflowWorkItem.svg" src="../resources/images/symbols/ebx_workflowWorkItem.svg"></img>.</p><p>Voir <a href="#workflowmodel">mod&egrave;le de workflow</a>.</p><h3 id="condition">
condition de workflow</h3>
<p>Etape de d&eacute;cision dans le workflow de donn&eacute;es.</p><p>Une condition de workflow de donn&eacute;es d&eacute;crit le crit&egrave;re utilis&eacute; pour d&eacute;terminer quelle sera la prochaine &eacute;tape &agrave; ex&eacute;cuter.</p><p>Les conditions de workflow sont repr&eacute;sent&eacute;es par l&#39;ic&ocirc;ne <img alt="/ebx_workflowCondition.svg" src="../resources/images/symbols/ebx_workflowCondition.svg"></img>.</p><h3 id="subworkflow">
appel &agrave; des sous-workflows</h3>
<p>Etape qui met le workflow de donn&eacute;es courant en attente et qui lance un ou plusieurs autres workflows de donn&eacute;es. Si une telle &eacute;tape lance plusieurs sous-workflows, les sous-workflows sont ex&eacute;cut&eacute;s en parall&egrave;le.</p><h3 id="waitTask">
t&acirc;che d&#39;attente</h3>
<p>Etape d&#39;un workflow de donn&eacute;es qui met en pause le workflow en cours en attendant un &eacute;v&eacute;nement donn&eacute;. Lorsque l&#39;&eacute;v&eacute;nement est re&ccedil;u, le workflow est r&eacute;veill&eacute; et va automatiquement &agrave; l&#39;&eacute;tape suivante.</p><h3 id="datacontext">
contexte des donn&eacute;es</h3>
<p>Ensemble de donn&eacute;es qui peuvent &ecirc;tre partag&eacute;es entre les &eacute;tapes pendant toute la dur&eacute;e de vie d&#39;un workflow afin de garantir la communication entre les &eacute;tapes. </p><h2 id="workflows">
Workflows de donn&eacute;es</h2>
<p><em>Section de la documentation <a href="../user_dataworkflow/userdataworkflow_intro.html">Workflows de donn&eacute;es</a></em></p><h3 id="workflowpub">
publication de workflow</h3>
<p>Version particuli&egrave;re d&#39;un mod&egrave;le de workflow de donn&eacute;es qui est mise &agrave; disposition des utilisateurs ayant les permissions n&eacute;cessaires pour ex&eacute;cuter des workflows.</p><p>L&#39;ancien nom (avant la version 5) de &quot;publication de workflow&quot; &eacute;tait &quot;workflow&quot;.</p><h3 id="workflow">
workflow de donn&eacute;es</h3>
<p>Instance particuli&egrave;re d&#39;un mod&egrave;le de workflow qui ex&eacute;cute les &eacute;tapes d&eacute;finies dans le mod&egrave;le de workflow de donn&eacute;es (les t&acirc;ches utilisateur, les t&acirc;ches automatiques et les conditions).</p><p>Voir <a href="#workflowmodel">mod&egrave;le de workflow</a>.</p><p>Concept apparent&eacute; : <a href="../user_dataworkflow/userdataworkflow_intro.html">Workflows de donn&eacute;es</a>.</p><p>L&#39;ancien nom (avant la version 5) de &quot;workflow de donn&eacute;es&quot; &eacute;tait &quot;workflow instance&quot;.</p><h3 id="worklist">
corbeille</h3>
<p>Liste des workflows de donn&eacute;es publi&eacute;s, affich&eacute;s en fonction des permissions de l&#39;utilisateur. Les utilisateurs qui ont la permission de lancer des workflows peuvent le faire &agrave; partir de leur corbeille. Tous les bons de travail n&eacute;cessitant une action de l&#39;utilisateur sont affich&eacute;s sous la publication de workflow associ&eacute;e dans la corbeille. De plus, si l&#39;utilisateur est administrateur de workflows de donn&eacute;es, il a la possibilit&eacute; de voir leur &eacute;tat dans sa corbeille et ainsi d&#39;intervenir, si n&eacute;cessaire, sur les workflows qu&#39;il supervise.</p><p>Voir <a href="#workflow">workflow de donn&eacute;es</a>.</p><h3 id="workitem">
bon de travail</h3>
<p>Action unitaire d&#39;une t&acirc;che utilisateur qui doit &ecirc;tre r&eacute;alis&eacute;e par un utilisateur.</p><p>Les bons de travail allou&eacute;s sont repr&eacute;sent&eacute;s par l&#39;ic&ocirc;ne <img alt="/ebx_workitem.png" src="../resources/images/symbols/ebx_workitem.png"></img>.</p><p>Voir <a href="#usertask">t&acirc;che utilisateur</a>.</p><h2 id="dataservices">
Services de donn&eacute;es</h2>
<p><em>Section de la documentation <a href="../user_dataservice/userdataservice_intro.html">Services de donn&eacute;es</a></em></p><h3 id="dataservice">
service de donn&eacute;es</h3>
<p>EBX&reg; partage les donn&eacute;es de r&eacute;f&eacute;rence conform&eacute;ment &agrave; l&#39; <a href="https://en.wikipedia.org/wiki/Service-oriented_architecture">Architecture Orient&eacute;e Service</a> en utilisant la technologie XML web service. Tous les services de donn&eacute;es sont g&eacute;n&eacute;r&eacute;s directement &agrave; partir des mod&egrave;les ou services built-in. Ils peuvent &ecirc;tre utilis&eacute;s pour acc&eacute;der &agrave; une partie des fonctionnalit&eacute;s disponibles via l&#39;interface utilisateur.</p><p>Les services de donn&eacute;es d&#39;EBX&reg; proposent :</p><ul>
<li><p>Un g&eacute;n&eacute;rateur WSDL pour les mod&egrave;les de donn&eacute;es ainsi que pour les services built-in. Le fichier WSDL peut-&ecirc;tre produit indiff&eacute;remment au travers de l&#39;interface utilisateur ou du connecteur HTTP(S) pour un logiciel d&#39;int&eacute;gration ou une application cliente. Les op&eacute;rations de services sont invoqu&eacute;es par des messages XML communiqu&eacute;s au point d&#39;entr&eacute;e d&#39;EBX&reg;.</p></li><li><p>Un connecteur SOAP, ou point d&#39;entr&eacute;e pour les messages SOAP, permet aux syst&egrave;mes externes d&#39;interagir avec le contenu du r&eacute;f&eacute;rentiel. Ce connecteur r&eacute;pond aux demandes issues des WSDL produits par EBX&reg;. Apr&egrave;s authentification, il accepte les messages XML et les ex&eacute;cute selon les permissions de l&#39;utilisateur authentifi&eacute;.</p></li><li><p>Un connecteur RESTful, ou point d&#39;entr&eacute;e pour les op&eacute;rations de s&eacute;lection, permet aux syst&egrave;mes externes d&#39;interroger le contenu du r&eacute;f&eacute;rentiel EBX&reg;. Apr&egrave;s authentification, il accepte la requ&ecirc;te d&eacute;finie dans l&#39;URL et l&#39;ex&eacute;cute selon les permissions de l&#39;utilisateur authentifi&eacute;.</p></li></ul>
<h3 id="lineage">
lignage</h3>
<p>M&eacute;canisme de mise en place de profils de droits d&#39;acc&egrave;s pour des services de donn&eacute;es. Les profils de droits d&#39;acc&egrave;s ainsi d&eacute;finis sont utilis&eacute;s pour acc&eacute;der aux donn&eacute;es via des interfaces WSDL.</p><p>Concept apparent&eacute; : <a href="../user_dataservice/userdataservice_actions.html#lineage">G&eacute;n&eacute;rer un WSDL pour un lignage</a>.</p><h2 id="miscellaneous">
Transverse</h2>
<h3 id="node">
noeud</h3>
<p>Un noeud est un &eacute;l&eacute;ment d&#39;une arborescence ou d&#39;un graphe. Dans EBX&reg;, &#39;Noeud&#39; peut faire r&eacute;f&eacute;rence &agrave; diff&eacute;rents concepts selon le contexte d&#39;utilisation :</p><ul>
<li><p>Dans le contexte du <a href="#workflowmodels">mod&egrave;le de workflow</a>, un noeud est une &eacute;tape du workflow ou une condition.</p></li><li><p>Dans le contexte du <a href="#datamodel">mod&egrave;le de donn&eacute;es</a>, un noeud est un groupe, une table ou un champ.</p></li><li><p>Dans le contexte des <a href="#customtableview">hi&eacute;rarchies</a>, un noeud repr&eacute;sente une valeur d&#39;une dimension.</p></li><li><p>Dans un arbre d&#39;<a href="#inheritance">h&eacute;ritage de jeux de donn&eacute;es</a>, un noeud est un jeu de donn&eacute;es.</p></li><li><p>Dans un <a href="#record">jeu de donn&eacute;es</a>, un noeud est le noeud du mod&egrave;le de donn&eacute;es &eacute;valu&eacute; dans le contexte du jeu de donn&eacute;es ou de l&#39;enregistrement.</p></li></ul>
<p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img> User guide <a href="../table_contents_user.html"> table of contents</a></em></p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Introduction</span></div>
</div>
<p id="ebx_footer"><b>TIBCO EBX® Version 6.0.1. </b>Copyright &copy; <a href="https://www.tibco.com" target="_blank" style="text-decoration: none;">TIBCO&nbsp;Software&nbsp;Inc.</a> 2001-2021. All rights reserved.<br></br>All third party product and company names and third party marks mentioned in this document are the property of their respective owners and are mentioned for identification.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shCore.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushBash.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushCss.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushDiff.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJava.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJScript.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushPlain.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushProperties.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushSql.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushXml.js">
</script>
<script type="text/javaScript">
SyntaxHighlighter.all();</script>
</body>
</html>
