<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>
TIBCO EBX® Documentation - Propri&eacute;t&eacute;s des &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es</title>
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type"></meta><meta content="Copyright TIBCO Software Inc. 2001-2021. All rights reserved." name="copyright"></meta><meta content="dm_properties" name="doc_id"></meta><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_common.css"></link><link rel="stylesheet" type="text/css" href="../resources/stylesheets/ebx_docPage.css"></link><link rel="stylesheet" type="text/css" href="../resources/syntaxHighlighter/styles/shCoreEclipse.css"></link><link rel="icon" type="image/x-icon" href="../resources/icons/brand.ico"></link></head>
<body class="ebx_simplePage">
<div id="ebx_centerer">
<div id="ebx_main">
<div id="printHeader">
<div class="productName">
TIBCO EBX®</div>
<div class="chapterName">
Documentation &gt; Guide utilisateur &gt; Modèles de données &gt; Implémentation des modèles de données</div>
</div>
<div id="ebx_breadcrumbTop">
<a id="ebx_navigationModeButton" class="ebx_clickableIconLink" href="../index.html?page=user_datamodel/userdatamodel_elementproperties.html" title="Afficher cette page avec l'en-tête et les panneaux de navigation" target="_top">Mode navigation</a><span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Modèles de données &gt; Implémentation des modèles de données</span></div>
<h1>
Propri&eacute;t&eacute;s des &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es</h1>
<p>Apr&egrave;s avoir cr&eacute;&eacute; un &eacute;l&eacute;ment, il est possible de d&eacute;finir des propri&eacute;t&eacute;s suppl&eacute;mentaires pour compl&eacute;ter sa d&eacute;finition.</p><div class="ebx_seealso">
<h5>
Voir aussi</h5>
<ul>
<li><a href="../user_datamodel/userdatamodel_elementcontrols.html">Contr&ocirc;les sur les &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es</a></li></ul>
</div>
<div id="toc">
<ul class="toc1">
<li class="toc1"><a href="#common">Propri&eacute;t&eacute;s basiques des &eacute;l&eacute;ments</a><ul class="toc2">
<li class="toc2"><a href="#id1s1">Propri&eacute;t&eacute;s basiques communes</a></li><li class="toc2"><a href="#id1s2">Propri&eacute;t&eacute;s basiques des champs</a></li></ul>
</li><li class="toc1"><a href="#advanced_props">Propri&eacute;t&eacute;s avanc&eacute;es des &eacute;l&eacute;ments</a><ul class="toc2">
<li class="toc2"><a href="#id2s1">Propri&eacute;t&eacute;s avanc&eacute;es communes</a></li><li class="toc2"><a href="#AdvancedPropertiesFields">Propri&eacute;t&eacute;s avanc&eacute;es des champs</a></li><li class="toc2"><a href="#table">Propri&eacute;t&eacute;s avanc&eacute;es des tables</a></li><li class="toc2"><a href="#id2s4">Propri&eacute;t&eacute;s avanc&eacute;es des groupes</a></li></ul>
</li></ul>
</div>
<h2 id="common">
Propri&eacute;t&eacute;s basiques des &eacute;l&eacute;ments</h2>
<h3 id="id1s1">
Propri&eacute;t&eacute;s basiques communes</h3>
<p>Les propri&eacute;t&eacute;s basiques suivantes sont disponibles pour plusieurs types d&#39;&eacute;l&eacute;ments :</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Information</p></td><td class="ebx_definitionListDefinition"><p>Informations suppl&eacute;mentaires non internationalis&eacute;es associ&eacute;es &agrave; l&#39;&eacute;l&eacute;ment.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Nombre minimum de valeurs</p></td><td class="ebx_definitionListDefinition"><p>Nombre minimum de valeurs pour cet &eacute;l&eacute;ment.</p><p>Les cl&eacute;s primaires ne pouvant &ecirc;tre multi-valu&eacute;es, cette propri&eacute;t&eacute; doit &ecirc;tre &eacute;gale &agrave; &quot;1&quot; ou &ecirc;tre &quot;non d&eacute;finie&quot;. </p><p>Pour les &eacute;l&eacute;ments de type &quot;Noeud de s&eacute;lection&quot;, le nombre minimum est automatiquement d&eacute;fini &agrave; &quot;0&quot;.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Nombre maximum de valeurs</p></td><td class="ebx_definitionListDefinition"><p>Nombre maximum de valeurs pour cet &eacute;l&eacute;ment. Si cette propri&eacute;t&eacute; est sup&eacute;rieure &agrave; &quot;1&quot;, l&#39;&eacute;l&eacute;ment est consid&eacute;r&eacute; comme multi-valu&eacute;.</p><p>Les cl&eacute;s primaires ne pouvant &ecirc;tre multi-valu&eacute;es, cette propri&eacute;t&eacute; doit &ecirc;tre &eacute;gale &agrave; &quot;1&quot; ou &ecirc;tre &quot;non d&eacute;finie&quot;.</p><p>Pour une table, le nombre maximum d&#39;&eacute;l&eacute;ments est d&eacute;fini &agrave; &quot;unbounded&quot; par d&eacute;faut lors de sa cr&eacute;ation.</p><p> Pour les &eacute;l&eacute;ments de type &quot;Noeud de s&eacute;lection&quot;,&nbsp;le nombre maximum d&#39;&eacute;l&eacute;ments est d&eacute;fini &agrave; &quot;0&quot; par d&eacute;faut lors de la d&eacute;finition des propri&eacute;t&eacute;s du noeud de s&eacute;lection.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="validationRules">R&egrave;gles de validation</p></td><td class="ebx_definitionListDefinition"><p>Cette propri&eacute;t&eacute; est disponible pour les champs situ&eacute;s dans une table, sauf pour les champs de type <code>Mot de passe</code>, les types r&eacute;utilisables, les champs des types complexes r&eacute;utilisables et les noeuds de s&eacute;lection. Cette propri&eacute;t&eacute; est utilis&eacute;e pour d&eacute;finir des r&egrave;gles de validation riches et complexes &agrave; l&#39;aide d&#39;un &eacute;diteur de pr&eacute;dicats XPath 1.0. </p><p>Voir <a href="../references/criteria_editor.html">&eacute;diteur de pr&eacute;dicats</a>. </p><p> Une r&egrave;gle de validation peut &ecirc;tre utile lorsque la validation de la valeur d&eacute;pend de crit&egrave;res complexes ou des valeurs d&#39;autres champs.</p><p>Il est aussi possible d&#39;indiquer qu&#39;une r&egrave;gle de validation d&eacute;finit des conditions sous lesquelles la valeur d&#39;un champ est obligatoire. La valeur du champ est obligatoire si les crit&egrave;res de la r&egrave;gle ne sont pas respect&eacute;s. Voir <a href="../models/constraints.html#constraintOnNull">Contraintes sur valeurs &quot;null&quot;</a> pour plus d&#39;informations.</p><p>En utilisant l&#39;assistant associ&eacute;, il est possible de d&eacute;finir des libell&eacute;s localis&eacute;s pour la r&egrave;gle de validation, ainsi qu&#39;un message localis&eacute; avec la s&eacute;v&eacute;rit&eacute; qui s&#39;affichera si le crit&egrave;re n&#39;est pas satisfait. </p><p> Il est possible d&#39;indiquer si la r&egrave;gle doit toujours &ecirc;tre valide ou non lorsqu&#39;un utilisateur soumet un formulaire. Cette option est uniquement disponible sur les r&egrave;gles de validation d&eacute;finies par un champ et lorsque la s&eacute;v&eacute;rit&eacute; du message est d&eacute;finie &agrave; &quot;erreur&quot;. Si les erreurs de validation ne sont pas autoris&eacute;es, alors toutes les saisies qui rendraient la r&egrave;gle invalide seront rejet&eacute;es et les donn&eacute;es seront non modifi&eacute;es. Si les erreurs de validation sont autoris&eacute;es alors toutes les saisies qui rendraient la r&egrave;gle invalide seront accept&eacute;es et les donn&eacute;es seront modifi&eacute;es. Si cette propri&eacute;t&eacute; n&#39;est pas sp&eacute;cifi&eacute;e, alors la r&egrave;gle bloquera uniquement les erreurs lors de la soumission d&#39;un formulaire. </p><p>Si une r&egrave;gle de validation est d&eacute;finie sur un champ de type table, alors cette r&egrave;gle sera consid&eacute;r&eacute;e comme une &quot;contrainte sur table&quot; et sera ex&eacute;cut&eacute;e sur chaque enregistrement de la table. Voir <a href="../models/constraints.html#constraintsOnTable">Contraintes sur table</a> pour plus d&#39;informations.</p></td></tr>
</table>
<h3 id="id1s2">
Propri&eacute;t&eacute;s basiques des champs</h3>
<p>Les propri&eacute;t&eacute;s basiques suivantes sont sp&eacute;cifiques aux champs simples :</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="defaultValue">Valeur par d&eacute;faut</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit une valeur par d&eacute;faut pour ce champ. </p><p>Cette valeur sera ins&eacute;r&eacute;e automatiquement dans le champ de saisie du formulaire de cr&eacute;ation des nouveaux enregistrements. Le type de la valeur par d&eacute;faut doit &ecirc;tre compatible avec le type du champ courant.</p><p>Voir <a href="../models/access_properties_categories.html#defaultValue">Valeur par d&eacute;faut</a> pour plus d&#39;informations.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Message d&#39;erreur de conversion</p></td><td class="ebx_definitionListDefinition"><p>Messages d&#39;erreur internationalis&eacute;s affich&eacute;s aux utilisateurs lors de la saisie d&#39;une valeur qui n&#39;est pas compatible avec le type du champ courant.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="computationrules">R&egrave;gle de calcul</p></td><td class="ebx_definitionListDefinition"><p>Cette propri&eacute;t&eacute; est disponible pour les champs des tables, except&eacute; pour les types r&eacute;utilisables. D&eacute;finit une r&egrave;gle de calcul pour la valeur du champ avec l&#39;aide d&#39;un &eacute;diteur de pr&eacute;dicats XPath 1.0. </p><p>Voir <a href="../references/criteria_editor.html">Editeur de pr&eacute;dicats</a> pour plus d&#39;informations. </p><p> Une r&egrave;gle de calcul peut &ecirc;tre utile lorsqu&#39;une valeur d&eacute;pend d&#39;autres valeurs dans le m&ecirc;me enregistrement, mais qu&#39;un calcul programmatique n&#39;est pas n&eacute;cessaire.</p><p>Les limitations suivantes existent pour les r&egrave;gles de calcul :</p><ul>
<li><p>Les r&egrave;gles de calcul s&#39;utilisent uniquement avec les champs simples d&#39;une table.</p></li><li><p>Les r&egrave;gles de calcul ne peuvent pas &ecirc;tre d&eacute;finies sur des champs du type <code>OResource</code> ou <code>Password</code>.</p></li><li><p>Les r&egrave;gles de calcul ne peuvent pas &ecirc;tre d&eacute;finies sur les noeuds de s&eacute;lection ni les champs cl&eacute;s primaires.</p></li><li><p>Les r&egrave;gles de calcul ne peuvent pas &ecirc;tre d&eacute;finies en acc&eacute;dant &agrave; l&#39;&eacute;l&eacute;ment depuis le rapport de validation.</p></li></ul>
</td></tr>
</table>
<h2 id="advanced_props">
Propri&eacute;t&eacute;s avanc&eacute;es des &eacute;l&eacute;ments</h2>
<h3 id="id2s1">
Propri&eacute;t&eacute;s avanc&eacute;es communes</h3>
<p>Les propri&eacute;t&eacute;s avanc&eacute;es suivantes sont disponibles pour plusieurs types d&#39;&eacute;l&eacute;ments :</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="default_view">Affichage par d&eacute;faut et outils &gt; Visibilit&eacute;</p></td><td class="ebx_definitionListDefinition"><p>Cette section permet d&#39;indiquer si cet &eacute;l&eacute;ment doit &ecirc;tre affich&eacute; dans la vue par d&eacute;faut d&#39;un jeu de donn&eacute;es, dans l&#39;outil de recherche textuelle d&#39;un jeu de donn&eacute;es, ou dans l&#39;op&eacute;ration &quot;select&quot; d&#39;un service de donn&eacute;es. Ces propri&eacute;t&eacute;s sont ignor&eacute;es si elles sont d&eacute;finies sur un &eacute;l&eacute;ment qui n&#39;est pas dans une table.</p><ul>
<li><p>Vue dirig&eacute;e par le mod&egrave;le</p><p>Indique si l&#39;&eacute;l&eacute;ment courant doit &ecirc;tre affich&eacute; ou non dans la vue par d&eacute;faut d&#39;un jeu de donn&eacute;es, la vue tabulaire par d&eacute;faut d&#39;une table et le formulaire par d&eacute;faut associ&eacute; aux enregistrements d&#39;une table. La vue par d&eacute;faut d&#39;un jeu de donn&eacute;es, la vue tabulaire par d&eacute;faut d&#39;une table, et le formulaire par d&eacute;faut associ&eacute; aux enregistrements d&#39;une table respectent la structure du jeu de donn&eacute;es ou de la table d&eacute;finie dans le mod&egrave;le de donn&eacute;es. <br/>Lorsque la propri&eacute;t&eacute; &quot;Cach&eacute;&quot; est s&eacute;lectionnn&eacute;e, l&#39;&eacute;l&eacute;ment courant ne sera pas affich&eacute; dans la vue par d&eacute;faut d&#39;un jeu de donn&eacute;es si l&#39;&eacute;l&eacute;ment courant est une table. <br/>Lorsque la propri&eacute;t&eacute; &quot;Cach&eacute;&quot; est s&eacute;lectionnn&eacute;e, l&#39;&eacute;l&eacute;ment courant ne sera pas affich&eacute; dans la vue tabulaire par d&eacute;faut et le formulaire par d&eacute;faut associ&eacute; aux enregistrements d&#39;une table si l&#39;&eacute;l&eacute;ment courant est dans une table. L&#39;&eacute;l&eacute;ment courant sera cependant affich&eacute; dans l&#39;assistant de cr&eacute;ation de vues tabulaires et hi&eacute;rarchiques. Il sera donc possible de cr&eacute;er une vue personnalis&eacute;e qui affichera l&#39;&eacute;l&eacute;ment courant. <br/>Si cette propri&eacute;t&eacute; n&#39;est pas renseign&eacute;e, alors l&#39;&eacute;l&eacute;ment courant sera affich&eacute; par d&eacute;faut. <br/>Cette propri&eacute;t&eacute; est ignor&eacute;e si elle est d&eacute;finie sur un champ qui n&#39;est ni une table, ni dans une table.</p></li><li><p>Toutes les vues</p><p>Lorsque la propri&eacute;t&eacute; &#39;Cach&eacute; dans les vues&#39; est s&eacute;lectionn&eacute;e, l&#39;&eacute;l&eacute;ment courant ne sera pas affich&eacute; dans les vues par d&eacute;faut, tabulaires (vue par d&eacute;faut incluse) ou hi&eacute;rarchiques, d&#39;une table d&#39;un jeu de donn&eacute;es. L&#39;&eacute;l&eacute;ment courant ne sera pas affich&eacute; dans l&#39;assistant de cr&eacute;ation de vues tabulaires et hi&eacute;rarchiques. Il ne sera donc pas possible de cr&eacute;er une vue personnalis&eacute;e qui affichera l&#39;&eacute;l&eacute;ment courant. Cette propri&eacute;t&eacute; concerne uniquement les vues. L&#39;&eacute;l&eacute;ment courant sera donc affich&eacute; dans le formulaire d&#39;un enregistrement si la propri&eacute;t&eacute; &#39;Cach&eacute; dans les vues&#39; est s&eacute;lectionn&eacute;e. Cette propri&eacute;t&eacute; est ignor&eacute;e si elle est d&eacute;finie sur un champ hors d&#39;une table.</p></li><li><p>Recherche structur&eacute;e</p><p>Lorsque la propri&eacute;t&eacute; &quot;Cach&eacute; dans la recherche structur&eacute;e&quot; est s&eacute;lectionn&eacute;e, l&#39;&eacute;l&eacute;ment courant ne sera pas affich&eacute; uniquement dans l&#39;outil de recherche typ&eacute;e d&#39;un jeu de donn&eacute;es. Cet &eacute;l&eacute;ment sera tout de m&ecirc;me pris en compte dans l&#39;outil de recherche rapide. Si ces propri&eacute;t&eacute;s concernant les recherches ne sont pas renseign&eacute;es, alors l&#39;&eacute;l&eacute;ment courant sera affich&eacute; par d&eacute;faut dans l&#39;outil de recherche typ&eacute;e d&#39;un jeu de donn&eacute;es. Cette propri&eacute;t&eacute; est ignor&eacute;e si elle est d&eacute;finie sur un champ hors d&#39;une table.</p></li><li><p>Services de donn&eacute;es</p><p>Lorsque la propri&eacute;t&eacute; &quot;Exclu dans les Data Services&quot; est s&eacute;lectionnn&eacute;e, l&#39;&eacute;l&eacute;ment courant ne sera pas inclus lors de l&#39;op&eacute;ration &quot;select&quot; d&#39;un data service. Cette propri&eacute;t&eacute; est ignor&eacute;e si elle est d&eacute;finie sur un champ hors d&#39;une table.</p></li></ul>
<p>Voir <a href="../models/access_properties_categories.html#defaultView">Default view</a> dans le Guide du d&eacute;veloppeur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="Widget">Affichage par d&eacute;faut et outils &gt; Widget</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit le widget &agrave; utiliser. Un widget est un composant de saisie qui est affich&eacute; dans les formulaires contenus dans les jeux de donn&eacute;es associ&eacute;s. <br/>Si aucun widget n&#39;est d&eacute;fini, alors un widget par d&eacute;faut sera affich&eacute; dans les jeux de donn&eacute;es associ&eacute;s. Ce widget par d&eacute;faut est d&eacute;fini &agrave; partir du type et des propri&eacute;t&eacute;s de l&#39;&eacute;l&eacute;ment courant. <br/>Il est possible d&#39;utiliser un widget natif ou un widget personnalis&eacute;. Un widget personnalis&eacute; est d&eacute;fini en utilisant une API Java. Cette API Java permet de d&eacute;velopper des composants de saisie riche pour des champs ou des groupes. <br/>Les widgets natifs et personnalis&eacute;s ne peuvent pas &ecirc;tre d&eacute;finis sur une table et une association. <br/>Il est interdit de d&eacute;finir en m&ecirc;me temps un widget personnalis&eacute; et un UI bean. <br/>Sur un champ de type cl&eacute; &eacute;trang&egrave;re, il est interdit de d&eacute;finir en m&ecirc;me temps un widget personnalis&eacute; et un s&eacute;lecteur de combo box.</p><p>Voir <a target="_blank" href="../Java_API/com/orchestranetworks/ui/form/widget/UIWidgetFactory.html"><code>UIWidgetFactory</code></a> pour plus d&#39;informations.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="Combobox_selector">Affichage par d&eacute;faut et outils &gt; S&eacute;lecteur combo box</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit le nom de la vue publi&eacute;e utilis&eacute;e dans le menu de s&eacute;lection de la cl&eacute; &eacute;trang&egrave;re. <br/> Un bouton de s&eacute;lection sera affich&eacute; en bas &agrave; droite de la liste d&eacute;roulante du menu de s&eacute;lection. Lors de la d&eacute;finition d&#39;une cl&eacute; &eacute;trang&egrave;re, cette fonctionnalit&eacute; permet d&#39;acc&eacute;der &agrave; une vue de s&eacute;lection avanc&eacute;e en cliquant sur le bouton &#39;S&eacute;lecteur&#39; qui ouvre la vue de s&eacute;lection avanc&eacute;e, permettant ainsi d&#39;utiliser les options de tri et de recherche. <br/> Si aucune vue publi&eacute;e n&#39;a &eacute;t&eacute; d&eacute;finie, la vue de s&eacute;lection avanc&eacute;e sera d&eacute;sactiv&eacute;e. <br/> Si le chemin de la table r&eacute;f&eacute;renc&eacute;e est absolu, alors seules les vues publi&eacute;es correspondant &agrave; cette table seront affich&eacute;es. Si le chemin de la table r&eacute;f&eacute;renc&eacute;e est relatif, alors toutes les vues associ&eacute;es au mod&egrave;le de donn&eacute;es contenant la table cible seront affich&eacute;es. Cette propri&eacute;t&eacute; ne peut pas &ecirc;tre utilis&eacute;e si un widget personnalis&eacute; est d&eacute;fini.</p><p> Voir <a href="../models/access_properties_categories.html#viewForAdvancedSelection">Defining a view for the combo box selector of a foreign key</a> dans le Guide du d&eacute;veloppeur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="ui_bean">UI bean</p></td><td class="ebx_definitionListDefinition"><div class="ebx_attention">
<h5>
Attention</h5>
<p> Depuis la version 5.8.0 de TIBCO EBX&reg;, il est recommand&eacute; d&#39;utiliser les widgets personnalis&eacute;s &agrave; la place des UI beans. Les widgets personnalis&eacute;s proposent plus de fonctionnalit&eacute;s que les UI beans. Plus d&#39;&eacute;volutions seront apport&eacute;es aux UI Beans. Voir <a href="#Widget"> widget</a> pour plus d&#39;informations. </p></div>
<p>Cette propri&eacute;t&eacute; est disponible pour tous les types d&#39;&eacute;l&eacute;ments, except&eacute; les tables. </p><p>Sp&eacute;cifie une classe Java permettant de personnaliser l&#39;interface utilisateur associ&eacute;e &agrave; cet &eacute;l&eacute;ment dans un jeu de donn&eacute;es. Un UI bean peut afficher l&#39;&eacute;l&eacute;ment diff&eacute;remment et/ou modifier sa valeur en &eacute;tendant la classe <a target="_blank" href="../Java_API/com/orchestranetworks/ui/UIBeanEditor.html"><code>UIBeanEditor</code></a> dans l&#39;API Java.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="transform_export">Transformation &agrave; l&#39;export</p></td><td class="ebx_definitionListDefinition"><p>Cette propri&eacute;t&eacute; est disponible pour les champs et pour les groupes qui sont des noeuds terminaux. </p><p>Sp&eacute;cifie une classe Java d&eacute;finissant des op&eacute;rations de transformation &agrave; effectuer lors de la cr&eacute;ation d&#39;une archive &agrave; partir d&#39;un jeu de donn&eacute;es associ&eacute;. La transformation &agrave; effectuer porte sur la valeur de l&#39;&eacute;l&eacute;ment courant.</p><p>Voir <a target="_blank" href="../Java_API/com/orchestranetworks/service/NodeDataTransformer.html"><code>NodeDataTransformer</code></a> pour plus d&#39;informations.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="access_props">Propri&eacute;t&eacute;s d&#39;acc&egrave;s</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit le mode d&#39;acc&egrave;s pour l&#39;&eacute;l&eacute;ment courant, &agrave; savoir&nbsp;:&nbsp;s&#39;il peut &ecirc;tre &eacute;crit et/ou lu.</p><ul>
<li><p>&quot;Lecture &amp; Ecriture&quot; correspond au mode <code>RW</code> dans le XSD du mod&egrave;le de donn&eacute;es.</p></li><li><p>&quot;Lecture seule&quot; correspond au mode <code>R-</code> dans le XSD du mod&egrave;le de donn&eacute;es.</p></li><li><p>&quot;El&eacute;ment hors d&#39;un jeu de donn&eacute;es&quot; correspond au mode <code>CC</code> dans le XSD du mod&egrave;le de donn&eacute;es.</p></li><li><p>&quot;Noeud non terminal&quot; correspond au mode <code>--</code> dans le XSD du mod&egrave;le de donn&eacute;es.</p></li></ul>
<p>Voir <a href="../models/access_properties_categories.html#accessproperties">Access properties</a> dans le Guide du d&eacute;veloppeur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="node_cat">Cat&eacute;gorie du noeud</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit les cat&eacute;gories permettant de restreindre la visualisation des donn&eacute;es. Un noeud de cat&eacute;gorie &quot;Hidden&quot; est cach&eacute; par d&eacute;faut dans un jeu de donn&eacute;es. </p><p>Restriction&nbsp;:&nbsp;la d&eacute;finition de cat&eacute;gorie ne s&#39;applique pas aux noeuds d&#39;enregistrement de tables, &agrave; l&#39;exception de la cat&eacute;gorie &quot;Hidden&quot;.</p><p>Voir <a href="../models/access_properties_categories.html#categories">Categories</a> dans le Guide du d&eacute;veloppeur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Mode de comparaison</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit un mode de comparaison pour l&#39;&eacute;l&eacute;ment. Ce mode permet de restreindre la comparaison des donn&eacute;es associ&eacute;es &agrave; l&#39;&eacute;l&eacute;ment.</p><ul>
<li><p>&quot;D&eacute;faut&quot; implique que l&#39;&eacute;l&eacute;ment est pris en compte lors de la comparaison de donn&eacute;es.</p></li><li><p>&quot;Ignor&eacute;&quot; implique qu&#39;aucune modification ne sera d&eacute;tect&eacute;e lors de la comparaison de deux entit&eacute;s modifi&eacute;es (jeux de donn&eacute;es ou enregistrements).</p><p>Lors de la fusion de donn&eacute;es, les valeurs des &eacute;l&eacute;ments ignor&eacute;s dans des jeux de donn&eacute;es ou enregistrements modifi&eacute;s ne sont pas fusionn&eacute;es. Les valeurs contenues dans de nouveaux jeux de donn&eacute;es ou enregistrements sont fusionn&eacute;es.</p><p>Lors de l&#39;import d&#39;une archive, les valeurs des &eacute;l&eacute;ments ignor&eacute;s dans des jeux de donn&eacute;es ou enregistrements modifi&eacute;s ne sont pas import&eacute;es. Les valeurs contenues dans de nouveaux jeux de donn&eacute;es ou enregistrements sont import&eacute;es.</p></li></ul>
<p>Voir <a href="../models/access_properties_categories.html#comparison_mode">Comparison mode</a> dans le Guide du d&eacute;veloppeur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>R&egrave;gle d&#39;application des derni&egrave;res modifications</p></td><td class="ebx_definitionListDefinition"><p>Indique si cet &eacute;l&eacute;ment doit &ecirc;tre inclus ou non dans le service permettant d&#39;appliquer &agrave; d&#39;autres enregistrements de la m&ecirc;me table les derni&egrave;res modifications effectu&eacute;es. </p><ul>
<li><p>&quot;D&eacute;faut&quot; indique que la derni&egrave;re modification effectu&eacute;e sur cet &eacute;l&eacute;ment peut &ecirc;tre appliqu&eacute;e &agrave; d&#39;autres enregistrements.</p></li><li><p>&quot;Ignor&eacute;&quot; indique que la derni&egrave;re modification effectu&eacute;e sur cet &eacute;l&eacute;ment ne peut pas &ecirc;tre appliqu&eacute;e &agrave; d&#39;autres enregistrements. Cet &eacute;l&eacute;ment ne sera pas visible dans le service permettant d&#39;appliquer les derni&egrave;res modifications. </p></li></ul>
<p>Voir <a href="../models/access_properties_categories.html#applyLastModification">Apply last modifications policy</a> dans le Guide du d&eacute;veloppeur.</p></td></tr>
</table>
<h3 id="AdvancedPropertiesFields">
Propri&eacute;t&eacute;s avanc&eacute;es des champs</h3>
<p>Les propri&eacute;t&eacute;s avanc&eacute;es suivantes sont sp&eacute;cifiques aux champs.</p><h4>
Contr&ocirc;le de saisie sur valeur nulle</h4>
<p>Impl&eacute;mente la propri&eacute;t&eacute; <code>osd:checkNullInput</code>. Cette propri&eacute;t&eacute; est utilis&eacute;e pour activer et v&eacute;rifier une contrainte sur valeur <code>null</code> lors de la saisie utilisateur.</p><p>Par d&eacute;faut, pour permettre une saisie temporairement incompl&egrave;te, la validation des &eacute;l&eacute;ments obligatoires est effectu&eacute;e, non pas lors de la saisie utilisateur, mais pendant la validation du jeu de donn&eacute;es. Si un &eacute;l&eacute;ment obligatoire doit &ecirc;tre v&eacute;rifi&eacute; imm&eacute;diatement lors de la saisie utilisateur, cette propri&eacute;t&eacute; doit avoir la valeur &quot;oui&quot;.</p><div class="ebx_note">
<h5>
Note</h5>
<p>Une valeur est consid&eacute;r&eacute;e comme obligatoire si le &quot;Nombre minimum de valeurs&quot; est &eacute;gal ou sup&eacute;rieur &agrave; &quot;1&quot;. Pour les &eacute;l&eacute;ments terminaux, les valeurs obligatoires sont seulement v&eacute;rifi&eacute;es dans les jeux de donn&eacute;es activ&eacute;s. Pour les &eacute;l&eacute;ments non terminaux, les valeurs sont v&eacute;rifi&eacute;es ind&eacute;pendamment de l&#39;&eacute;tat d&#39;activation du jeu de donn&eacute;es.</p></div>
<p>Voir <a href="../models/constraints.html#checkNullInput">Constraints, triggers and functions</a> dans le Guide utilisateur.</p><h4>
Supprimer espaces</h4>
<p>Supprimer espaces</p><p>Impl&eacute;mente la propri&eacute;t&eacute; osd:trim. Cette propri&eacute;t&eacute; permet d&#39;indiquer si les espaces avant ou apr&egrave;s une valeur doivent &ecirc;tre supprim&eacute;s lors de la saisie utilisateur. Si cette propri&eacute;t&eacute; n&#39;est pas d&eacute;finie, alors les espaces avant ou apr&egrave;s une valeur seront supprim&eacute;s par d&eacute;faut lors de la saisie utilisateur.</p><p>Voir <a href="../models/constraints.html#whitespaces_userInputs">Whitespace handling upon user input</a> dans le Guide utilisateur.</p><h4>
UI bean</h4>
<p>Voir <a href="#ui_bean">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Fonction (valeur calcul&eacute;e)</h4>
<p>Cette propri&eacute;t&eacute; est disponible pour les champs qui ne sont pas des cl&eacute;s primaires. Elle sp&eacute;cifie une classe Java permettant de calculer la valeur de ce champ programmatiquement. Peut &ecirc;tre utile si la valeur de ce champ d&eacute;pend d&#39;autres valeurs dans le r&eacute;f&eacute;rentiel, ou si le calcul de la valeur doit r&eacute;cup&eacute;rer des donn&eacute;es depuis un syst&egrave;me externe.</p><p>Une fonction peut &ecirc;tre cr&eacute;&eacute;e en impl&eacute;mentant l&#39;interface <a target="_blank" href="../Java_API/com/orchestranetworks/schema/ValueFunction.html"><code>ValueFunction</code></a>.</p><h4>
D&eacute;sactiver validation</h4>
<p>Indique si les contraintes d&eacute;finies sur le champ doivent &ecirc;tre d&eacute;sactiv&eacute;es. Cette propri&eacute;t&eacute; peut uniquement &ecirc;tre d&eacute;finie sur des champs calcul&eacute;s. Si &#39;Oui&#39;, les contraintes simples, avanc&eacute;es et de cardinalit&eacute; ne seront pas ex&eacute;cut&eacute;es lors de la validation des jeux de donn&eacute;es associ&eacute;s au mod&egrave;le de donn&eacute;es.</p><h4>
Transformation &agrave; l&#39;export</h4>
<p>Voir <a href="#transform_export">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Propri&eacute;t&eacute;s d&#39;acc&egrave;s</h4>
<p>Voir <a href="#access_props">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Auto-incr&eacute;ment</h4>
<p>Cette propri&eacute;t&eacute; est disponible uniquement pour les champs de type &quot;entier&quot; contenus dans une table. Si elle est activ&eacute;e, la valeur du champ est calcul&eacute;e automatiquement lors de la cr&eacute;ation d&#39;un nouvel enregistrement. Peut &ecirc;tre utile pour les cl&eacute;s primaires, car l&#39;auto-incr&eacute;ment g&eacute;n&egrave;re un identifiant unique pour chaque enregistrement. Deux attributs peuvent &ecirc;tre sp&eacute;cifi&eacute;s :</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Valeur de d&eacute;marrage</p></td><td class="ebx_definitionListDefinition"><p>Valeur initiale de l&#39;auto-incr&eacute;ment. Si aucune valeur n&#39;est d&eacute;finie, la valeur par d&eacute;faut est &quot;1&quot;.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Pas de l&#39;incr&eacute;ment</p></td><td class="ebx_definitionListDefinition"><p>La valeur ajout&eacute;e &agrave; la valeur pr&eacute;c&eacute;dente de l&#39;auto-incr&eacute;ment. Si aucune valeur n&#39;est d&eacute;finie, la valeur par d&eacute;faut est &quot;1&quot;.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>D&eacute;sactiver les contr&ocirc;les de l&#39;auto-incr&eacute;ment</p></td><td class="ebx_definitionListDefinition"><p>Indique s&#39;il faut d&eacute;sactiver le contr&ocirc;le de la valeur d&#39;un champ auto-incr&eacute;ment&eacute; par rapport &agrave; la valeur maximale trouv&eacute;e dans la table en cours de mise &agrave; jour. </p></td></tr>
</table>
<p>Les valeurs auto-incr&eacute;ment&eacute;es ont le comportement suivant :</p><ul>
<li><p>Le calcul et l&#39;allocation de la valeur de ce champ sont effectu&eacute;s d&egrave;s qu&#39;un nouvel enregistrement est ins&eacute;r&eacute; et que la valeur du champ est ind&eacute;finie.</p></li><li><p>Aucune allocation ne peut &ecirc;tre r&eacute;alis&eacute;e si l&#39;insertion programmatique sp&eacute;cifie d&eacute;j&agrave; une valeur diff&eacute;rente de <code>null</code>. Par cons&eacute;quent, cette allocation n&#39;est pas effectu&eacute;e &agrave; l&#39;insertion d&#39;un enregistrement en mode occultation ou r&eacute;&eacute;criture.</p></li><li><p>Si une archive import&eacute;e sp&eacute;cifie cette valeur, alors elle est pr&eacute;serv&eacute;e.</p></li><li><p>Une valeur nouvellement allou&eacute;e est, autant que possible, unique au sein du r&eacute;f&eacute;rentiel.</p><p>Plus pr&eacute;cis&eacute;ment, le caract&egrave;re unique de l&#39;allocation s&#39;&eacute;tend &agrave; tous les jeux de donn&eacute;es bas&eacute;s sur le mod&egrave;le de donn&eacute;es, et &eacute;galement &agrave; tous les espaces de donn&eacute;es. Ce dernier cas de figure permet de fusionner un espace de donn&eacute;es &agrave; son parent avec une garantie raisonnable d&#39;absence de conflit lorsque la valeur auto-incr&eacute;ment&eacute;e fait partie des enregistrements d&#39;une cl&eacute; primaire. </p><p>Ce principe a une limitation tr&egrave;s sp&eacute;cifique&nbsp;:&nbsp;quand une op&eacute;ration majeure de mise &agrave; jour sp&eacute;cifiant des valeurs est r&eacute;alis&eacute;e en simultan&eacute; d&#39;une op&eacute;ration allouant une valeur au m&ecirc;me champ, il est possible que cette derni&egrave;re op&eacute;ration alloue une valeur qui sera fix&eacute;e par la premi&egrave;re op&eacute;ration (il n&#39;y a pas de verrouillage entre plusieurs espaces de donn&eacute;es).</p></li></ul>
<p>Voir <a href="../models/triggersAndFunctions.html#autoIncrementedFields">Auto-incremented values</a> dans le Guide du d&eacute;veloppeur.</p><h4>
Affichage par d&eacute;faut</h4>
<p>Voir <a href="#default_view">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Cat&eacute;gorie du noeud</h4>
<p>Voir <a href="#node_cat">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Champ h&eacute;rit&eacute;</h4>
<p>D&eacute;finit une relation entre le champ courant et un champ dans une autre table afin de chercher sa valeur automatiquement.</p><table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Enregistrement source</p></td><td class="ebx_definitionListDefinition"><p>Une cl&eacute; &eacute;trang&egrave;re ou une s&eacute;quence de cl&eacute;s &eacute;trang&egrave;res, s&eacute;par&eacute;es par des espaces, permettant de trouver l&#39;enregistrement dont h&eacute;rite le champ courant. Si cette propri&eacute;t&eacute; n&#39;est pas renseign&eacute;e, alors l&#39;&eacute;l&eacute;ment courant sera utilis&eacute; comme source d&#39;h&eacute;ritage de champ.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>&Eacute;l&eacute;ment source</p></td><td class="ebx_definitionListDefinition"><p>Chemin XPath d&eacute;finissant l&#39;&eacute;l&eacute;ment &agrave; h&eacute;riter. L&#39;&eacute;l&eacute;ment source doit &ecirc;tre terminal, se trouver dans &quot;Enregistrement source&quot;, et son type doit &ecirc;tre le m&ecirc;me que le type de ce champ. Cette propri&eacute;t&eacute; est obligatoire pour l&#39;h&eacute;ritage de champ.</p></td></tr>
</table>
<p>Voir <a href="../glossary/simple_glossary.html#inheritance">h&eacute;ritage</a> dans le glossaire. </p><p>Pour plus d&#39;informations, voir aussi <a href="../references/inheritance.html#ina">Inherited fields</a>. </p><h3 id="table">
Propri&eacute;t&eacute;s avanc&eacute;es des tables</h3>
<p>Les propri&eacute;t&eacute;s avanc&eacute;es suivantes sont sp&eacute;cifiques aux tables.</p><h4>
Table</h4>
<table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Cl&eacute; primaire</p></td><td class="ebx_definitionListDefinition"><p>Liste des champs composant la cl&eacute; primaire de la table. Il est possible d&#39;ajouter ou de supprimer des champs de la cl&eacute; primaire.</p><p>Chaque champ de la cl&eacute; est identifi&eacute; par un chemin XPath absolu qui d&eacute;bute sous la table.</p><p>Si la cl&eacute; est composite, la liste des champs doit &ecirc;tre s&eacute;par&eacute;e par des espaces. Par exemple, &quot;/name /startDate&quot;.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Pr&eacute;sentation</p></td><td class="ebx_definitionListDefinition"><p>Sp&eacute;cifie la mani&egrave;re dont les enregistrements de cette table sont affich&eacute;s dans l&#39;interface utilisateur dans les jeux de donn&eacute;es associ&eacute;s.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Labellisation des enregistrements</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit les champs composant le libell&eacute; par d&eacute;faut et les libell&eacute;s localis&eacute;s pour les enregistrements de la table.</p><p>Peut aussi d&eacute;finir une classe Java pour affecter le libell&eacute; programmatiquement, ou d&eacute;finir le libell&eacute; dans une hi&eacute;rarchie. Cette classe Java doit impl&eacute;menter l&#39;interface <a target="_blank" href="../Java_API/com/orchestranetworks/ui/UILabelRenderer.html"><code>UILabelRenderer</code></a> ou <a target="_blank" href="../Java_API/com/orchestranetworks/ui/UILabelRendererForHierarchy.html"><code>UILabelRendererForHierarchy</code></a> de l&#39;API Java. </p><p><strong>Attention&nbsp;:&nbsp;</strong>Les droits d&#39;acc&egrave;s d&eacute;finis dans les jeux de donn&eacute;es associ&eacute;s ne sont pas appliqu&eacute;s lors de l&#39;affichage des libell&eacute;s. <br/> Les champs habituellement cach&eacute;s &agrave; cause de droits d&#39;acc&egrave;s seront affich&eacute;s dans les libell&eacute;s des enregistrements.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p id="rendering">Pr&eacute;sentation par d&eacute;faut des groupes dans un formulaire</p></td><td class="ebx_definitionListDefinition"><p>Sp&eacute;cifie la politique d&#39;affichage par d&eacute;faut des groupes contenus dans cette table. Si cette propri&eacute;t&eacute; n&#39;est pas d&eacute;finie, alors la politique par d&eacute;faut sera utilis&eacute;e pour afficher les groupes.</p><p>Voir <a href="../engine/admin_frontend.html#rendering">Record form: rendering mode for nodes</a> dans le Guide d&#39;administration.</p><p><strong>Pr&eacute;sentation activ&eacute;e des groupes</strong> : sp&eacute;cifie un mode de pr&eacute;sentation autoris&eacute; en compl&eacute;ment de &quot;D&eacute;velopp&eacute;&quot; et &quot;R&eacute;duit&quot;, qui sont toujours disponibles. Les liens doivent &ecirc;tre activ&eacute;s sur la table afin de d&eacute;finir sp&eacute;cifiquement le mode de pr&eacute;sentation des groupes en tant que liens.</p><p><strong>Pr&eacute;sentation par d&eacute;faut des groupes</strong>&nbsp;:&nbsp;sp&eacute;cifie la pr&eacute;sentation par d&eacute;faut des groupes contenus dans cette table. Si un groupe ne sp&eacute;cifie aucune vue par d&eacute;faut, alors le mode de pr&eacute;sentation par d&eacute;faut d&eacute;fini par cette table sera utilis&eacute;. En fonction des performances du r&eacute;seau et du navigateur, ajustez la mani&egrave;re d&#39;afficher chaque groupe du formulaire. En ce qui concerne le poids de la page t&eacute;l&eacute;charg&eacute;e, le mode &quot;Lien&quot; est l&eacute;ger, les modes &quot;D&eacute;velopp&eacute;&quot; et &quot;R&eacute;duit&quot; sont plus lourds.</p><p><strong>Note :</strong> quand les onglets sont activ&eacute;s dans une table, tous les groupes qui utiliseraient les liens dans les autres cas sont convertis automatiquement en mode &quot;R&eacute;duit&quot;. Cela permet d&#39;&eacute;viter les complexit&eacute;s d&#39;affichage qui se posent quand les liens et les onglets sont dans la m&ecirc;me interface utilisateur.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Pr&eacute;sentation sp&eacute;cifique d&#39;un formulaire</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit une pr&eacute;sentation sp&eacute;cifique pour personnaliser le formulaire d&#39;un enregistrement dans les jeux de donn&eacute;es associ&eacute;s.</p><p> Voir <a target="_blank" href="../Java_API/com/orchestranetworks/ui/form/UIForm.html"><code>UIForm</code></a> et <a target="_blank" href="../Java_API/com/orchestranetworks/userservice/schema/UserServiceRecordFormFactory.html"><code>UserServiceRecordFormFactory</code></a> pour plus d&#39;informations. </p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Barres d&#39;outils</p></td><td class="ebx_definitionListDefinition"><p id="toolbars">D&eacute;finit les barres d&#39;outils &agrave; afficher dans la table.</p><p>Les barres d&#39;outils peuvent &ecirc;tre consult&eacute;es et modifi&eacute;es dans la section <em>Configuration &gt; Barre d&#39;outils</em>.</p><p><strong>Ent&ecirc;te de table: </strong>D&eacute;finit la barre d&#39;outils &agrave; afficher en ent&ecirc;te de la vue table par d&eacute;faut.</p><p><strong>Ligne de table: </strong>D&eacute;finit la barre d&#39;outils &agrave; afficher pour chaque ligne de la vue table par d&eacute;faut.</p><p><strong>Ent&ecirc;te de formulaire: </strong>D&eacute;finit la barre d&#39;outils &agrave; afficher en ent&ecirc;te du formulaire d&#39;un enregistrement.</p><p><strong>Ent&ecirc;te de hi&eacute;rarchie: </strong>D&eacute;finit la barre d&#39;outils &agrave; afficher en ent&ecirc;te de la hi&eacute;rarchie par d&eacute;faut de la table.</p><p>Voir <a href="../user_datamodel/userdatamodel_extensions.html#toolbarStructure">Barre d&#39;outils</a> pour plus d&#39;informations.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Historisation</p></td><td class="ebx_definitionListDefinition"><p>Sp&eacute;cifie si l&#39;historisation est activ&eacute;e, et le niveau de garantie demand&eacute;. Les profils d&#39;historisation peuvent &ecirc;tre modifi&eacute;s dans la section <strong>Administration &gt; Historique et journaux</strong>.</p><p>Voir <a href="../references/history.html#configuration">Configuration de l&#39;historique dans le r&eacute;f&eacute;rentiel</a> pour plus d&#39;informations.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Filtres sp&eacute;cifiques</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit des filtres pour afficher uniquement les enregistrements correspondant &agrave; certains crit&egrave;res.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Actions</p></td><td class="ebx_definitionListDefinition"><p>Indique les actions autoris&eacute;es ou interdites dans le contexte d&#39;un jeu de donn&eacute;es. Toutes les actions sont autoris&eacute;es par d&eacute;faut, cependant des droits d&#39;acc&egrave;s peuvent &ecirc;tre d&eacute;finis dans les jeux de donn&eacute;es associ&eacute;s pour restreindre ces actions.</p></td></tr>
</table>
<h4>
 Contraintes d&#39;unicit&eacute; </h4>
<p>Indique les champs dont les valeurs doivent &ecirc;tre uniques dans la table.</p><h4>
Triggers &agrave; la mise &agrave; jour</h4>
<p>Sp&eacute;cifie des classes Java d&eacute;finissant des m&eacute;thodes ex&eacute;cut&eacute;es automatiquement lorsque des op&eacute;rations sont effectu&eacute;es&nbsp;:&nbsp;cr&eacute;ation, mise &agrave; jour, suppression, etc.</p><p>Un trigger natif est inclus par d&eacute;faut pour lancer les workflows de donn&eacute;es.</p><p>Voir <a href="../models/triggersAndFunctions.html#triggers">Triggers</a> dans le Guide du d&eacute;veloppeur.</p><h4>
Propri&eacute;t&eacute;s d&#39;acc&egrave;s</h4>
<p>Voir <a href="#access_props">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Affichage par d&eacute;faut</h4>
<p>Voir <a href="#default_view">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Cat&eacute;gorie du noeud</h4>
<p>Voir <a href="#node_cat">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h3 id="id2s4">
Propri&eacute;t&eacute;s avanc&eacute;es des groupes</h3>
<p>Les propri&eacute;t&eacute;s avanc&eacute;es suivantes sont sp&eacute;cifiques aux groupes.</p><h4>
Classe du conteneur de valeurs (JavaBean)</h4>
<p>D&eacute;finit une classe Java pour contenir les valeurs des &eacute;l&eacute;ments situ&eacute;s sous le groupe. La classe Java sp&eacute;cifi&eacute;e doit &ecirc;tre conforme &agrave; la sp&eacute;cification JavaBean. Cela signifie que chaque &eacute;l&eacute;ment enfant de ce groupe doit correspondre &agrave; une propri&eacute;t&eacute; de la classe Java. Toutes les propri&eacute;t&eacute;s de la classe Java doivent avoir des m&eacute;thodes d&#39;acc&egrave;s (getters et setters).</p><h4>
UI bean</h4>
<p>Voir <a href="#ui_bean">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Transformation &agrave; l&#39;export</h4>
<p>Voir <a href="#transform_export">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4>
Propri&eacute;t&eacute;s d&#39;acc&egrave;s</h4>
<p>Voir <a href="#access_props">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><h4 id="defaultView">
Affichage par d&eacute;faut</h4>
<table class="ebx_definitionList">
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Visibilit&eacute;</p></td><td class="ebx_definitionListDefinition"><p>Voir <a href="#default_view">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p></td></tr>
<tr class="ebx_definitionListItem">
<td class="ebx_definitionListTerm"><p>Pr&eacute;sentation</p></td><td class="ebx_definitionListDefinition"><p>D&eacute;finit la mani&egrave;re dont ce groupe sera pr&eacute;sent&eacute; dans un jeu de donn&eacute;es. Si cette propri&eacute;t&eacute; n&#39;est pas d&eacute;finie, alors la vue par d&eacute;faut d&eacute;finie par la table parente sera utilis&eacute;e. Les options &quot;Onglet&quot; et &quot;Lien&quot; sont disponibles uniquement si la table parente a activ&eacute; ces options de pr&eacute;sentation. </p><p><strong><em>Propri&eacute;t&eacute;s de l&#39;onglet</em></strong></p><p><strong>Position:</strong> Cet attribut sp&eacute;cifie la position de l&#39;onglet par rapport &agrave; tous les onglets d&eacute;finis dans le mod&egrave;le. Cette position est utilis&eacute;e pour ordonnancer la liste des onglets au moment de l&#39;affichage d&#39;un formulaire. Si cette propri&eacute;t&eacute; n&#39;est pas d&eacute;finie, alors l&#39;onglet sera positionn&eacute; en fonction de la position du groupe dans le mod&egrave;le de donn&eacute;es. </p></td></tr>
</table>
<h4>
Cat&eacute;gorie du noeud</h4>
<p>Voir <a href="#node_cat">Propri&eacute;t&eacute;s avanc&eacute;es communes</a>.</p><div class="ebx_seealso">
<h5>
Concepts apparentés</h5>
<ul>
<li><a href="../user_datamodel/userdatamodel_elementcontrols.html">Contr&ocirc;les sur les &eacute;l&eacute;ments du mod&egrave;le de donn&eacute;es</a></li></ul>
</div>
<p class="noPrint" align="right"><em><img alt="/ebx_search.png" src="../resources/images/symbols/ebx_search.png"></img><a href="../table_contents_user.html">Sommaire</a></em> du guide utilisateur</p><div id="ebx_breadcrumbBottom">
<span class="ebx_breadcrumbLabel">Documentation &gt; Guide utilisateur &gt; Modèles de données &gt; Implémentation des modèles de données</span></div>
</div>
<p id="ebx_footer"><b>TIBCO EBX® Version 6.0.1. </b>Copyright &copy; <a href="https://www.tibco.com" target="_blank" style="text-decoration: none;">TIBCO&nbsp;Software&nbsp;Inc.</a> 2001-2021. All rights reserved.<br></br>All third party product and company names and third party marks mentioned in this document are the property of their respective owners and are mentioned for identification.</p></div>
<script type="text/javaScript" src="../resources/yui/yahoo/yahoo-min.js">
</script>
<script type="text/javaScript" src="../resources/yui/event/event-min.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_doc_utils.js">
</script>
<script type="text/javaScript" src="../resources/jscripts/ebx_simplePage.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shCore.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushBash.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushCss.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushDiff.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJava.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushJScript.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushPlain.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushProperties.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushSql.js">
</script>
<script type="text/javaScript" src="../resources/syntaxHighlighter/scripts/shBrushXml.js">
</script>
<script type="text/javaScript">
SyntaxHighlighter.all();</script>
</body>
</html>
